# This module is part of https://github.com/nabilanavab/ilovepdf
# Feel free to use and contribute to this project. Your contributions are welcome!
# copyright ©️ 2021 nabilanavab

file_name = "ILovePDF/lang/hnd.py"

from configs.config   import settings


_CLOSE = "🚶बंद करें 🚶"
_RESTART = "☠ `𝐎𝐕𝐄𝐑𝐋𝐎𝐀𝐃 𝐃𝐄𝐂𝐓𝐄𝐂𝐓𝐄𝐃`☠:\n__𝐬𝐞𝐫𝐯𝐞𝐫 𝐫𝐞𝐬 𝐭𝐚𝐫𝐭𝐞𝐝__ \n\nमैंने देखा कि आपका काम भी कतार में था\n\nक्या आप कृपया पुनः प्रयास कर सकते हैं..!"
_STOP = "अरे {}!\n{} आपके जीवन को आसान बनाने के लिए यहां है,\n\n`लेकिन दुर्भाग्य से यह वर्तमान में कुछ सर्वर-साइड रखरखाव का अनुभव कर रहा है।`\n\n__हालांकि चिंता करने की कोई आवश्यकता नहीं है, बस नीचे दिए गए बटन पर क्लिक करें, और जैसे ही यह वापस चालू हो जाएगा और सुचारू रूप से चलने लगेगा मैं आपको बता दूंगा।__"
_STOP_CB_ = "🔔जब यह चालू हो जाए तो मुझे पिंग करें 🔔"
_SETTINGS = "⚙️ सेटिंग्स ⚙️"
_LANGUAGE = "🌍 भाषा 🌍"
_HELP = "📚मदद 📚"
_CHANNEL = "📢 चैनल 📢"
_SOURCE = "🌟स्रोत कोड 🌟"
_ADD_GROUP = "➕ ग्रुप में जोड़ें ➕"
_THUMB = "थंबनेल"
_NAME = "नाम"
_API = "एपीआई"
_CAPTION = "कैप्शन"
_BACK_HOME = " घर वापिस जा रहा हूँ "
_INSTRUCTIONS = "🛈 निर्देश 🛈"
_HOME_A = "अरे {}..!!\nआपका स्वागत है {}.!\n\nइस टूल से, आप आसानी से छवियों को पीडीएफ में परिवर्तित कर सकते हैं, पीडीएफ फाइलों को संपीड़ित कर सकते हैं, विभाजित कर सकते हैं, मर्ज कर सकते हैं, पीडीएफ को एन्क्रिप्ट या डिक्रिप्ट कर सकते हैं, पीडीएफ पृष्ठों को घुमा सकते हैं, और भी बहुत कुछ कर सकते हैं। \n\nबस मुझे एक पीडीएफ/छवि भेजें और यह अनुरोधित कार्रवाई करेगा। सहायता के लिए किसी भी समय '⚠️ सहायता ⚠️' चुनें। पीडीएफ बॉट आपके जीवन को आसान बनाने के लिए यहां है..\n\nइसे अभी आज़माएं और देखें कि यह आपकी सभी पीडीएफ जरूरतों में कैसे मदद कर सकता है!"
_HOME_B = "सेटिंग पेज ⚙️\n\nउपयोगकर्ता नाम: {}\nउपयोगकर्ता आईडी: {}\nउपयोगकर्ता नाम: {}\nशामिल होने की तिथि: {}\n\nभाषा: {}\nएपीआई: {}\nअंगूठा: {}\nकैप्शन: {} \nफ़ाइल का नाम : {}"
_HOME_C = "**कुछ मुख्य विशेषताएं हैं:**\n\n ◍ ```अपनी छवियों से एक पीडीएफ बनाएं: बस इसे बॉट पीएमएस [पीएनजी, जेपीजी, जेपीईजी] में भेजें```\n ◍ ```निकालें पीडीएफ से पाठ: पीडीएफ फाइल से पाठ को निकालने और अलग संदेश के रूप में भेजने में मदद करता है। ```\n ◍ ```एकाधिक पीडीएफ को एक में मिलाएं: कई पीडीएफ फाइलों को एक ही फाइल में संयोजित करें```\n ◍ ```एक पीडीएफ को अलग-अलग पृष्ठों में विभाजित करें: बड़ी पीडीएफ फाइल को अलग-अलग पृष्ठों में विभाजित करें`` ``\n ◍ ```पीडीएफ से छवियां निकालें: [सभी, श्रेणी, पृष्ठ] छवि, दस्तावेज़, ज़िप, रार के रूप में```\n ◍ ```छवियों को अनुकूलित करके आकार को कम करने में मदद करता है। फ़ाइल बहुत बड़ी होने पर ईमेल के माध्यम से भेजने में उपयोगी```\n ◍ ```मेटाडेटा प्राप्त करता है: दस्तावेज़ का शीर्षक, लेखक, विषय, दस्तावेज़ से जुड़े कीवर्ड, और निर्माण और संशोधन तिथियां```\ n ◍ ```पासवर्ड का उपयोग करके पीडीएफ को एन्क्रिप्ट/डिक्रिप्ट करें, पीडीएफ के लिए वेबसाइटें, घुमाएं, नाम बदलें, स्टैंब..```\n ◍ ```वॉटरमार्क, कंबाइन, ज़ूम, ड्रा, पेज जोड़ें/डिलीट करें, ओसीआर पीडीएफ..` ``\n ◍ ```पीडीएफ फाइलों के लिए पाठ संदेश, और भी बहुत कुछ.. 😎```"
_HOME_D = "``जैसा कि आप जानते हैं, यह एक निःशुल्क सेवा है, मैं इसकी गारंटी नहीं दे सकता कि मैं इस सेवा को कितने समय तक बनाए रख सकता हूँ..`😝\n\n ⚠️ निर्देश ⚠️:\n ◍ ```कृपया ध्यान दें कि स्पैमिंग आम तौर पर बर्दाश्त नहीं की जाती है और इसका परिणाम हो सकता है उपयोगकर्ता या बॉट को सेवा से प्रतिबंधित किया जा रहा है```\n ◍ ```बॉट द्वारा फ़ाइल को संसाधित करने की प्रतीक्षा करें: बॉट पीडीएफ फ़ाइल को संसाधित करेगा और अनुरोधित कार्रवाई करेगा। फ़ाइल के आकार और की जा रही कार्रवाई की जटिलता के आधार पर इसमें कुछ मिनट लग सकते हैं।```\n ◍ ```एक बार जब बॉट कार्रवाई पूरी कर लेगा, तो यह आपको परिणाम भेजेगा। यदि कार्रवाई सफल रही, तो आपको आउटपुट प्राप्त होगा। यदि कार्रवाई सफल नहीं हुई, तो बॉट आपको बताएगा और कोई भी प्रासंगिक त्रुटि संदेश प्रदान करेगा। n**शुरू करने के लिए कोई भी छवि भेजें:** 😁"
_SELECT_LANG = "अब, कोई भी भाषा चुनें.."
_DEFAULT = "डिफ़ॉल्ट ❌"
_CUSTOM = "कस्टम ✅"
_CANT_USE = "इस सुविधा का उपयोग नहीं किया जा सकता ❌"
_WAIT = "इंतज़ार कर रहा हूँ.. 🥱"
_REPORT = "आपको जो भी बग मिले उसकी रिपोर्ट करें!"
_ADD = "♻ जोड़ें ♻"
_CHANGE = "♻ बदलें ♻"
_DELETE = "🗑हटाएँ 🗑"
_SET_THUMB = "सेटिंग ⚙️ » थंबनेल 📷"
_SET_NAME = "सेटिंग ⚙️ »फ़ाइल नाम 📷"
_SET_API = "सेटिंग ⚙️ »एपीआई 📷"
_SET_CAPT = "सेटिंग ⚙️ » कैप्शन 📷"
_SET_LANG = "सेटिंग ⚙️ » लैंग बदलें 🌐"
_SEND = "अब, मुझे भेजो.."
_SEND_FAST = "अब, मुझे भेजें.. 😅\n\nजल्दी! मेरे पास पाठ पर विचार करने के लिए और समय नहीं है.. 😏\n\n/रद्द करें: रद्द करने के लिए"
_ASK_API = "\n\nनीचे** लिंक खोलें और मुझे गुप्त कोड भेजें:"
_LANG_FEED = "बग चेतावनी! यदि मेरे पाठ अजीब लगते हैं, तो संभवतः यह Google अनुवाद की गलती है।\n\n{} लैंग में एक बग की रिपोर्ट करें:\n`• लैंग निर्दिष्ट करें\n• त्रुटि संदेश\n• नया संदेश`"
_RES_SUCCESS = "सेटिंग्स सफलतापूर्वक अपडेट की गईं ✅"
_RES_FAIL = "सेटिंग्स अपडेट नहीं की जा सकतीं ❌"
_OPEN_BROW = "🔗 ब्राउज़र में खोलें 🔗"
_ERROR_DB = "डेटाबेस से डेटा पुनर्प्राप्त करते समय कुछ गलत हो गया"
_START = "स्वागत संदेश.."
_TXT2PDF = "टेक्स्ट पीडीएफ बनाएं"
_FEEDBACK = "फीडबैक लिखें 📋"
_PG_NUM = "`पेजों की संख्या: •{}•` 🌟"
_PDF_REPLY = "`मुझे इस फ़ाइल के साथ क्या करना चाहिए?`\n\nफ़ाइल का नाम: `{}`\nफ़ाइल का आकार: `{}`"
_META = "⭐ पीडीएफ मेटा£एटीए ⭐"
_PREVIEW = "📸 पीडीएफ पूर्वावलोकन 📸"
_IMAGE = "🖼️ छवियों के लिए पीडीएफ 🖼"
_TEXT = "📑 पीडीएफ टू टेक्स्ट 📑"
_ROTATE = "🤸 पीडीएफ घुमाएँ 🤸"
_FORMAT = "😗 पीडीएफ प्रारूप 😗"
_WATERMARK = "💦 वॉटरमार्क पीडीएफ 💦"
_RENAME = "✏️ पीडीएफ का नाम बदलें ✏"
_ZOOM = "🔎 ज़ूम पीडीएफ पीजी 🔎"
_URL = "🔗 यूआरएल जनरेट करें 🔗"
_FILTER = "👻 फ़िल्टर जोड़ें 👻"
_CODEC = "__मैं इस फ़ाइल के साथ कुछ नहीं कर सकता।__ 😏\n\n🐉 `कोडेक त्रुटि` 🐉"
_CODEC_CB = "❌ कोडेक में त्रुटि ❌"
_ENCRYTED_FILE = "`फ़ाइल एन्क्रिप्टेड है` 🔐\n\nफ़ाइल का नाम: `{}`\nफ़ाइल का आकार: `{}`"
_DECRYPT = "🔓 पीडीएफ को डिक्रिप्ट करें 🔓"
_ENCRYPT = "🔐एन्क्रिप्ट पीडीएफ 🔐"
_REASON = "\n\nकारण: {}"
_BAN = "अरे {}\n\nकिसी कारण से आप इस बॉट का उपयोग नहीं कर सकते :("
_BAN_G = "{} मुझसे कभी भी अच्छे रिस्पॉन्स की उम्मीद न करें\n\nएडमिन ने मुझे यहां काम करने से प्रतिबंधित कर दिया है.. 🤭"
_BAN_CB = "उफ़, आपका दिल तोड़ने के लिए क्षमा करें, यह संदेश आपके लिए नहीं है 💔।\n\nअगली बार के लिए शुभकामनाएँ! 😏"
_FOOL = "कृपया मुझे मूर्ख बनाने की कोशिश न करें.. 🤭"
_CREATE_BOT = "अपना खुद का बॉट बनाएं"
_FORCE = "प्रतीक्षा करें [{}](tg://user?id={})..!!\n\nभारी ट्रैफिक के कारण केवल **चैनल सदस्य** ही इस बॉट का उपयोग कर सकते हैं 🚶\nइसका मतलब है कि आपको ** की आवश्यकता है मेरा उपयोग करने के लिए नीचे उल्लिखित चैनल से जुड़ें**!\n\nशामिल होने के बाद `'♻️retry♻️'` पर क्लिक करें.. 😅"
_JOIN_CHANNEL =  "🌟चैनल से जुड़ें 🌟"
_REFRESH = "♻️ ताज़ा करें ♻️"
_BACK = "" पीछे ""
_SPLIT = "✂️ स्प्लिट पीडीएफ ✂"
_MERGE = "🧬 पीडीएफएस को मर्ज करें 🧬"
_COMPRESS = "🗜 पीडीएफ कंप्रेस करें 🗜"
_OCR = "📝 ओसीआर परत जोड़ें 📝"
_STAMP = "™️ स्टाम्प पीडीएफ ™️"
_DRAW = "🎨 पीडीएफ बनाएं 🎨"
_BAW = "⚫ काला/सफ़ेद ⚪"
_SAT = "🪐सैटुरारे पीडीएफ 🪐"
_INV = "🖌 पीडीएफ पलटें 🖌"
_ADD_PG = "🟢 पेज जोड़ें 🟢"
_DEL_PG = "🔴 पेज हटाएं 🔴"
_ADD_PGNUM = "🔢नंबर जोड़ें 🔢"
_MORE = "अधिक विकल्प ↓"
_LESS = "कम दिखाएं ↑"
_HEADER = "🤕हेडर जोड़ें 🤕"
_FOOTER = "🐾 पाद लेख जोड़ें 🐾"
_P2IMG = "⚙️ पीडीएफ » छवियाँ ↓"
_P2IMG_ = "⚙️ पीडीएफ » छवियाँ » {} ↓"
_P2I = "🖼आईएमजी 🖼"
_P2D = "📂 डॉक्टर 📂"
_P2Z = "🤐 ज़िप 🤐"
_P2T = "🎯टार 🎯"
_ALL = "🙄सभी 🙄"
_CUSTOM = "🤧 कस्टम 🤧"
_B_ROTATE = "⚙️ पीडीएफ » घुमाएँ ↓"
_B_TEXT = "⚙️ पीडीएफ » TXT ↓"
_B_TEXT_M = "📜 संदेश 📜"
_B_WATERMARK = "⚙️ पीडीएफ » वॉटरमार्क ↓"
_B_TEXT_T = "💬 पाठ 💬"
_B_PDF = "📎 पीडीएफ 📎"
_WATER_OP = "⚙️ पीडीएफ » वॉटरमार्क » {} » OPCACity ↓"
_WATER_PO = "⚙️ पीडीएफ » वॉटरमार्क » स्थिति ↓"
_TOP = "⬆️ टॉप ⬆️"
_MIDDLE = "↔️ मध्य ↔️"
_BOTTOM = "⬇️ BoTToM ⬇️"
_WATER_COLOR = "⚙️ पीडीएफ » वॉटरमार्क » रंग ↓"
_B_STAMP = "⚙️ पीडीएफ » स्टाम्प ↓"
_STAMP_COLOR = "⚙️ पीडीएफ » टिकट » रंग ↓"
_PROGRESS = "\n**हो गया ✅ : **{0}/{1}\n**गति 🚀:** {2}/s\n**अनुमानित समय ⏳:** {3}"
_UPLOADING = "अपलोड हो रहा है"
_CANCEL = "🎯रद्द करें 🎯"
_NO_QUEUE = "`कोई कतार नहीं मिली..`😲"
_NO_IMG = "कोई छवि नहीं मिली.!! 😒"
_DL_IMG = "डाउनलोड की गई {} छवियाँ 🥱"
_GEN_PDF = "फ़ाइल का नाम: `{}`\nपेज: `{}`"
_REN_PDF = "अब मुझे एक फ़ाइल नाम भेजें 😒:"
_DLT_QUEUE = "`कतार सफलतापूर्वक हटा दी गई..`🤧"
_GEN_CB = "📚 पीडीएफ जनरेट किया जा रहा है.."
_AIO = "😏 सब एक में 😏"
_SINGLE_USE = "😎 एकल उपयोग 😎"
_START_UPLOAD = "`अपलोड करना शुरू कर दिया..`📤"
_START_DOWNL = "`आपकी फ़ाइल डाउनलोड हो रही है..` 📥"
_PROCESSING = "⚙️ प्रसंस्करण.."
_W_I_P = "कार्य प्रगति पर है.. 🙇"
_DL_IMG = "`आपकी छवि डाउनलोड हो रही है..⏳`"
_TAKE_TIME = "```⚙️ कार्य प्रगति पर है..\nइसमें कुछ समय लग सकता है..```💛"
_CONVERT = "`परिवर्तित: {} से {}`"
_UNSUPPORT = "असमर्थित फ़ाइल..🙄`"
_ADMIN_ONLY = "कुछ टेलीग्राम सीमाओं के कारण..\n\nमैं केवल एक व्यवस्थापक के रूप में काम कर सकता हूं\n__कृपया मुझे व्यवस्थापक के रूप में पदोन्नत करें__ ☺️"
_NOT_DOC = "भाई कृपया किसी दस्तावेज़ या छवि का उत्तर दें..🤧"
_G_ADMIN = "केवल ग्रुप एडमिन ही इस बॉट का उपयोग कर सकते हैं, अन्यथा मेरे पास आएं"
_NOT_YOUR = "`केवल व्यवस्थापक ही ऐसा कर सकते हैं..`\n\nया अपने पीडीएफ पर प्रयास करें (__अपने संदेश का उत्तर दें__)"
_WASTE = "`कोई आपकी मदद नहीं करेगा` 😏"
_GENERATE ="📚उत्पन्न करें 📚"
_HD = "अब इमेज टू पीडीएफ एचडी मोड में है 😈"
_BACK_DEFAULT = "«डिफ़ॉल्ट गुणवत्ता पर वापस जाएँ`"
_NO_API = "`कृपया कन्वर्ट एपीआई जोड़ें.. 💩\n\nस्टार्ट » सेटिंग्स » एपीआई » जोड़ें/बदलें`"
_ERROR = "कुछ गलत हो गया.. 🐉\n\nत्रुटि: `{}`"
_NOT_DOKR = "`फ़ाइल समर्थित नहीं है, डॉकर का उपयोग करके बॉट तैनात करें`"
_BIG = "अधिभार के कारण, स्वामी ने पीडीएफ फाइलों के लिए {}एमबी की सीमा तय की है 🙇\n\n`कृपया मुझे {}एमबी आकार` से कम की फ़ाइल भेजें 🙃"
_BIG_SUPP = "💎 2जीबी सपोर्ट बॉट बनाएं 💎"
_IMG_ADDED = "`आपके पीडीएफ में {} पेज जोड़े गए..`🤓\n\nफ़ाइल का नाम: `{}.pdf`"
_TRUE = "✅ सत्य ✅"
_FALSE = "🔴झूठा 🔴"
_PASS_REQUIRED = "क्या पीडीएफ फाइल को खोलने के लिए पासवर्ड की आवश्यकता होती है?"
_YES = "✅ हाँ ✅"
_NO = "🔴नहीं 🔴"
_MOVE = "⏭ आगे बढ़ें ⏭"
_WAIT_TXT = "अब मुझे कोई भी टेक्स्ट संदेश भेजें.. 😪"
_AIO_QN = "`मुझे इस फ़ाइल के साथ क्या करना चाहिए?`🤔💭\n\nइनपुट:\n	फ़ाइल का नाम: `{}`\n	फ़ाइल का आकार: `{}`\n	पासवर्ड: ||•{}•| |\n\nआउटपुट:\n	फ़ाइल का नाम: `•{}•`\n	वॉटरमार्क: `•{}•`\n	पासवर्ड: ||•{}•||"
_PROCEED = "🆗 प्रक्रिया 🆗"
_EXIT = "`प्रक्रिया रद्द..` 😏"
_NOTHING = "बनाने को कुछ नहीं.. 😏"
_TEXT2PDF = "`अब आप टेक्स्ट संदेशों से पीडीएफ बना सकते हैं.. होश उड़ गए.. है ना..? 😲\n\nआरंभ करने के लिए, बस नीचे दिए गए विकल्प का चयन करें और अपने पीडीएफ को सर्वोत्तम दिखाने के लिए अपने लेआउट को अनुकूलित करें.. 😎😏`"
_TEXT2PDF_S = "txt को पीडीएफ में परिवर्तित करना प्रारंभ करें..🎉"
_TEXT2PDF_T = "__टेक्स्ट टू पीडीएफ » अब, कृपया एक शीर्षक दर्ज करें:__\n\n/exit __to cancel__\n/skip __to stop__"
_TEXT2PDF_P = "__टेक्स्ट टू पीडीएफ » अब, कृपया पैराग्राफ दर्ज करें {}:__\n\n/exit __to cancel__\n/create __to create__"
_GET_TG_PDF = "🧭 पीडीएफ फाइल प्राप्त करें 🧭"
_DONE = "```लगभग पूरा हो गया.. ✅\nअब, अपलोड करना शुरू कर दिया है.. 📤```"
_TEXT_REPLY = "मुझे कोई यूआरएल या डायरेक्ट टेलीग्राम पीडीएफ लिंक भेजें"
_TG_PDF = "[चैट खोलें]({})\n\n**चैट के बारे में ↓**\nचैट का प्रकार: {}\nचैट का नाम: {}\nचैट का Usr: @{}\nचैट आईडी: {}\nदिनांक: {}\ n**मीडिया के बारे में ↓**\nमीडिया : {}\nफ़ाइल का नाम : {}\nफ़ाइल का आकार : {}\nफ़ाइल प्रकार : {}"
_CHECK = "रुको.. मुझे आने दो.. 😜"
_DOWNLOADING = "डाउनलोड किया जा रहा"
_COMPLETED = "😎पूरा 😎"
_NOT_DEV = "यह सुविधा विकासाधीन है ⛷️"
_STILL_ERROR = "एरर एनेनन परांजिल.. फिर क्या.. 😏"
_CANCELED = "प्रक्रिया रद्द.. 😏"
_NOT_ENCRYPT = "फ़ाइल एन्क्रिप्टेड नहीं.. 👀"
_NOTHING_OFF = "इसके बारे में कुछ भी आधिकारिक नहीं.. 😅"
_SEARCH = "️♻️ खोजें ♻️"
_OPEN_BOT = "😇 बॉट में खोलें 😇"
_TOTAL = "क्वेरी खोज से {} परिणाम प्राप्त हुए.. 🎁"
_LANG = "आपकी आरामदायक भाषा सेट करने में मदद करें 😇"
_SEARCH_PDF = "🔎 पीडीएफ खोजें 🔎"
_SEARCH_DES = "अब आप पीडीएफ दस्तावेज़ों की विशाल लाइब्रेरी में आसानी और सुविधा से खोज सकते हैं। इनलाइन खोज मोड का उपयोग करके, आप बस उस दस्तावेज़ का नाम टाइप कर सकते हैं जिसे आप ढूंढ रहे हैं"
_MIN_SEARCH = "🔎 पीडीएफ फाइलों को खोजने के लिए टाइप करें.."
_NO_RESULT = "🤐 '{}' के लिए कोई परिणाम नहीं"
_GET_PDF = "⚔ पीडीएफ प्राप्त करें ⚔"
_OLD_QUEUE = "पुरानी कतार.. नई आज़माएं.. 🙄"
_INLINE_CAP = "एमडी5: {}\nशीर्षक: **{}.**\nलेखक: **{}.**\n\nवॉल्यूम: {}\nवर्ष: {}\nपृष्ठ: {}\nभाषा: {}\nप्रकाशक: { }"
_INLINE_DES = "लेखक: {}\nखंड: {} वर्ष: {} पृष्ठ: {}\nभाषा: {} विस्तार: {}\nप्रकाशक: {}"
_DL_COMPLETED = "`डाउनलोडिंग पूर्ण..` ✅\n\n```प्रक्रिया प्रारंभ\nइसमें कुछ समय लग सकता है..``` 🙇📝"
_PASS_ERROR = "क्षमा करें, यह पासवर्ड पीडीएफ फ़ाइल को डिक्रिप्ट करने के लिए अमान्य है"
_CANT_COMP = "अधिक संपीड़ित नहीं कर सकता 🙂"
_ASK_NAME = "पीडीएफ नया नाम दर्ज करें:\n\n/रद्द करने के लिए बाहर निकलें"
_ASK_MERGE = "__पीडीएफ को मर्ज करें » कतार में कुल पीडीएफ: {}\n\n/रद्द करने के लिए बाहर निकलें\n/मर्ज करने के लिए मर्ज करें__"
_ASK_PASS = "_पीडीएफ {} »\nअब, कृपया पासवर्ड दर्ज करें :__\n\n/रद्द करने के लिए __बाहर निकलें__"
_ASK_PG = "कृपया पीडीएफ पेज सिंटैक्स दर्ज करें जिसे आप उपयोग करना चाहते हैं,\n\nसिंटेक्स:\n	पेज की सीमा: `[प्रारंभ, अंत]`,\n	विशिष्ट पृष्ठ: `अल्पविराम द्वारा अलग किया गया`।\n\nउदाहरण: `1,3,5,12:19`"
_ASK_PG_ERROR = "`पेज नंबर के लिए अमान्य सिंटैक्स`\n`एनबी: पीडीएफ में केवल {} पेज हैं` ⭐.\n\nकृपया पेज नंबर के लिए एक वैध सिंटैक्स दर्ज करें,\nजैसे कि `[स्टार्ट:एंड]` या `[पेज_नंबर्स]` ."
_MORE_PGS = "इसमें बहुत सारे पेज हैं, मुझे 5 पेज से कम की पीडीएफ भेजें 😐"
_YOUR_ERROR = "आपको कोई बड़ी समस्या है..🙂"
_OWN_RES = "मालिक प्रतिबंधित 😎🤏"
_ENCRYPT_CAPT = "__पेज नंबर__: {}\n__key__ 🔐: ||{}||"
_RENAME_CAPT = "पुराना नाम: `{}`\nनया नाम: `{}`"
_COMP_CAPT = "पुरानी फ़ाइल का आकार: `{}`\nनया फ़ाइल का आकार: `{}`\nअनुपात: `{}`%"
_COMPLETED_SUCC = "सफलतापूर्वक पूरा। 😎"
_CANCELED_CB = "🍄रद्द 🍄"
_TOTAL_PG = "`कुल पृष्ठ: {}..⏳`"
_CANCEL_AT = "`{}/{} पेजों पर रद्द किया गया..` 🙄"
_UPLOADING_AL = "`अपलोड हो रहा है: {}/{} पेज.. 🐬`"
_SIZE_LOAD = "`अधिभार के कारण बॉट केवल %sMb PDF का समर्थन करता है.."
_MERGE_DL = "`डाउनलोड हो रहा है {}`"
_START_MERGE = "``{} पीडीएफ़ को मर्ज करना शुरू किया गया`"
_WATERMARK_TXT = "__अब, मुझे एक टेक्स्ट संदेश भेजें__\n\n/exit : रद्द करने के लिए"
_WATERMARK_PDF = "__मुझे वॉटरमार्क पीडीएफ भेजें।__\n\n/exit : रद्द करने के लिए"
_WATERMARK_IMG = "__मुझे फ़ाइल के रूप में वॉटरमार्क छवि भेजें__\n__ समर्थित फ़ाइलें [पीएनजी, जेपीईजी, जेपीजी]__\n\n/बाहर निकलें: रद्द करने के लिए"
_ADD_WATERMARK = "पीडीएफ फाइल में वॉटरमार्क जोड़ना 😎"
_READ_AGAIN = "कृपया इस संदेश को दोबारा पढ़ें.. 🥴😲"
_ZIP_CONVERT = "`परिवर्तित {}/{}` 😎"
_GENERATING = "`🔗उत्पन्न हो रहा है..`"
_UNKNOWN_ERROR = "दुर्भाग्य से, हमें एक त्रुटि का सामना करना पड़ा 😓"
_NOTIFY = "जब कोई यह पीडीएफ लाए तो सूचित करें"
_URL_PROCES = "```🔗जनरेट किया जा रहा है..\nहम इस पर काम कर रहे हैं!\n\nकृपया प्रसंस्करण पूरा होने के लिए कुछ समय दें।```"
_URL_TYPE = "`🔗जनरेट कर रहा है..`\n\n**सार्वजनिक** 📢:\n__इस लिंक के माध्यम से एक्सेस की गई फ़ाइल सार्वजनिक रूप से उपलब्ध होगी, जिससे कोई भी इसे सहेज सकता है और अग्रेषित कर सकता है__।\n\n**सुरक्षा** 🔐:\n__सुनिश्चित करता है संदेश को अग्रेषित करने और सहेजने से रोककर उसकी गोपनीयता बनाए रखें__।"
_NOTIFY_CB = "🔔सूचित करें 🔔"
_MUTE_CB = "🔕म्यूट करें 🔕"
_PUBLIC = "📢सार्वजनिक 📢"
_PRIVATE = "🔐निजी 🔐"
_GEN_LINK = "**यह रहा! आप यही खोज रहे थे..**"
_ERROR_ = "उफ़, ऐसा लगता है जैसे कुछ ग़लत हो गया है। कृपया बाद में पुनः प्रयास करें।\n\n`त्रुटि:` {}"
_AIO_PROCESS = "```{} कार्य प्रगति पर है..🔰\nप्रतीक्षा करें इसमें कुछ समय लग सकता है.. 💔```"
_VIEW_ONLY = "लिंक में केवल दृश्य पहुंच प्रतिबंधित है.. 👀"
_REFER_T = "🎁रेफ़रल लिंक 🎁"
_REFER_D = "अपने मित्र को रेफर करें.."
_CLICK_RIGHT = "चयन करने के लिए राइट साइड बटन पर क्लिक करें। 👉"
_REFER = "आमंत्रित: {} उपयोगकर्ता!\nकृपया इस बॉट का उपयोग करने के लिए कम से कम 5 नए उपयोगकर्ताओं को देखें ☺\n\nआपका रेफरल लिंक: {}"
_NOW_BETA = "`अब आप बीटा उपयोगकर्ता हैं..` ☺"
_NOW_NOT_BETA = "`अब आप बीटा परीक्षण में भाग नहीं लेंगे..` 😐"
_BETA_MSG = "🍄 बीटा में शामिल हों [मुफ़्त] 🍄"
_BETA_MESSAGE = "**🔰 हमारे बीटा प्रोग्राम में शामिल हों 🔰**\n__अपने दोस्तों को रेफर करें और बीटा संस्करण का हिस्सा बनें, आसानी से कई कार्यों को आसानी से संभालने के लिए विशेष पहुंच को अनलॉक करें।__\n\n🎀 __एक बार जब आप अपना रेफरल लिंक जेनरेट कर लें।__\n 🎀 __इस रेफरल लिंक का उपयोग करके 5 दोस्तों को शामिल होने के लिए आमंत्रित करें।__\n🎀 __एक बार जब आप 5 दोस्तों को सफलतापूर्वक रेफर कर लें, तो /बीटा कमांड भेजें।__\n🎀 'ऑल-इन-वन' विकल्प अब भेजते या अग्रेषित करते समय उपलब्ध होगा एक पीडीएफ।\n🎀 एक ही प्रक्रिया में कई कार्यों को निर्बाध रूप से करने की उन्नत क्षमताओं का आनंद लें।\n\n**__आपका रेफरल लिंक:__** {}\n**__लिंक साझा करें__: [यहां क्लिक करें]({}) **"
_SELECT_SCALE = "🖼 स्केल चुनें 🖼"
_SELECT_HEAD_FONT = "✒ शीर्षक फ़ॉन्ट चुनें ✒"
_SELECT_PARA_FONT = "🪂पैराग्राफ फ़ॉन्ट चुनें 🪂"
_SELECT_COLOR = "🎨रंग चुनें 🎨"
_USE_DEFAULT = " डिफ़ॉल्ट उपयोग करें "
_SELECT_BG_COLOR = "🎨 पृष्ठभूमि छवि चुनें 🎨"


_STOP_CB = { _STOP_CB_ : "ping_me"}
RESTART = { "msg" : _RESTART, "btn" : { _CLOSE : "close|mee" }}
HOME = {
    "HomeA" : _HOME_A, "HomeB" : _HOME_B, "HomeC" : _HOME_C, "HomeD" : _HOME_D, "search" : [_SEARCH_PDF, _BETA_MSG],
    "HomeACB" : { _SETTINGS : "Home|B", _LANGUAGE : "set|lang", _HELP : "Home|C", _CHANNEL : f"{str(settings.OWNED_CHANNEL)}",
                 _SOURCE : f"{str(settings.SOURCE_CODE)}", _ADD_GROUP : "https://t.me/{}?startgroup=True" },
    "HomeAdminCB" : { _SETTINGS : "Home|B", _LANGUAGE : "set|lang", _HELP : "Home|C",
        "🗽 STATUS 🗽" : f"status|home", _ADD_GROUP : "https://t.me/{}?startgroup=True", _CLOSE : "close|mee" },
    "HomeBCB" : { _THUMB : "set|thumb", _NAME : "set|fname", _API : "set|api", _CAPTION : "set|capt", _BACK_HOME : "Home|B2A" },
    "HomeCCB" : { _BACK_HOME : "Home|A", _INSTRUCTIONS : "Home|D" }, "HomeDCB" : { _HELP : "Home|C", _BACK_HOME : "Home|A" } }
HomeG = { "HomeACB" : { _LANGUAGE : "set|lang", _HELP : "Home|C", _CHANNEL : f"{str(settings.OWNED_CHANNEL)}",
    _SOURCE : f"{settings.SOURCE_CODE}", _CLOSE : "close|mee" }, "HomeA" : _HOME_A}
SETTINGS = {
    "lang" : _SELECT_LANG, "default" : [_DEFAULT, _CUSTOM], "cant" : _CANT_USE, "wait" : { _WAIT : "nabilanavab" },
    "feedbtn" : { _REPORT : settings.REPORT }, "chgLang" : { _SET_LANG : "nabilanavab"}, "askApi" : _ASK_API,
    "result" : [_RES_FAIL, _RES_SUCCESS], "waitApi" : { _OPEN_BROW : "https://www.convertapi.com/a/signin" }, "error" : _ERROR_DB,
    "back" : [{ _BACK_HOME : "Home|B2S" }, { _BACK_HOME : "Home|B2A" }], "feedback" : _LANG_FEED, "ask" : [_SEND, _SEND_FAST],
    "thumb" : [{ _SET_THUMB : "nabilanavab", _ADD : "set|thumb+", _BACK_HOME : "Home|B"},
               { _SET_THUMB : "nabilanavab", _CHANGE : "set|thumb+", _DELETE : "set|thumb-", _BACK_HOME : "Home|B2S"}],
    "fname" : [{ _SET_NAME : "nabilanavab", _ADD : "set|fname+", _BACK_HOME : "Home|B2S"},
               {_SET_NAME : "nabilanavab", _CHANGE : "set|fname+", _DELETE : "set|fname-", _BACK_HOME : "Home|B2S"}],
    "api" : [{ _SET_API : "nabilanavab", _ADD : "set|api+", _BACK_HOME : "Home|B2S"},
             { _SET_API : "nabilanavab", _CHANGE : "set|api+", _DELETE : "set|api-", _BACK_HOME : "Home|B2S"}],
    "capt" : [{ _SET_CAPT : "nabilanavab", _ADD : "set|capt+", _BACK_HOME : "Home|B2S"},
              { _SET_CAPT : "nabilanavab", _CHANGE : "set|capt+", _DELETE : "set|capt-", _BACK_HOME : "Home|B2S"}] }
BOT_COMMAND = { "start" : _START, "txt2pdf" : _TXT2PDF }
STATUS_MSG = {
    "_HOME" : {
        "📊 ↓ SERVER ↓ 📊" : "nabilanavab", "📶 STORAGE 📶" : "status|server", "🥥 DATABASE 🥥" : "status|db",
        "🌝 ↓ GET LIST ↓ 🌝": "nabilanavab", "💎 ADMIN 💎" : "status|admin", "👤 USERS 👤" : "status|users", _BACK_HOME : "Home|A"
    },
    "DB" : """📂 DATABASE :\n\n**◍ Database Users :** `{}` 📍\n**◍ Database Chats :** `{}` 📍""",
    "SERVER" : "**◍ Total Space     :** `{}`\n**◍ Used Space     :** `{}({}%)`\n**◍ Free Space      :** `{}`\n**◍ CPU Usage      :** `{}`%"
               "**◍ RAM Usage     :** `{}`%\n**◍ Current Work  :** `{}`\n**◍ Message Id     :** `{}`",
    "USERS" : "Users in Database are.", "NO_DB" : "No dataBASE set Yet 💩", "ADMIN" : "**Total ADMIN:** __{}__\n",
    "BACK" : { _BACK_HOME : "status|home" }, "HOME" : "`Now, select any option below to get current STATUS 💱.. `",}
feedbackMsg = f"[{_FEEDBACK}]({settings.FEEDBACK})"
BAN = {
    "UCantUse" : _BAN, "UCantUseDB" : _BAN + _REASON, "GroupCantUse" : _BAN_G, "GroupCantUseDB" : _BAN_G + _REASON,
    "cbNotU" : _BAN_CB, "Fool" : _FOOL, "Force" : _FORCE, "ForceCB" : { _JOIN_CHANNEL : "{0}", _REFRESH : "refresh{1}" },
    "banCB" : {_CREATE_BOT : f"{settings.SOURCE_CODE}", _SOURCE : f"{settings.SOURCE_CODE}", _CHANNEL : "https://t.me/ilovepdf_bot"}}
PDF_MESSAGE = {
    "pg" : _PG_NUM , "pdf" : _PDF_REPLY, "encryptCB" : { _DECRYPT : "#decrypt", _CLOSE : "close|all" },
    "pdf_button" : { _META[1:] : "#metadata", _PREVIEW[1:] : "#preview", _ENCRYPT[1:] : "#encrypt", _DECRYPT[1:] : "#decrypt", _SPLIT[1:] : "#split",
        _MERGE[1:] : "#merge", _RENAME[1:] : "#rename", _URL[1:] : "link", _WATERMARK[1:] : "pdf|wa", _STAMP[1:] : "pdf|stp", 
        _IMAGE[1:] : "pdf|img", _TEXT[1:] : "pdf|txt", _COMPRESS[1:] : "#compress", _MORE : "pdf|more", _CLOSE : "close|all" },
    "all_pdf_button" : { _META[1:] : "#metadata", _PREVIEW[1:] : "#preview", _ENCRYPT[1:] : "#encrypt", _DECRYPT[1:] : "#decrypt",
        _SPLIT[1:] : "#split", _MERGE[1:] : "#merge", _RENAME[1:] : "#rename", _URL[1:] : "link", _WATERMARK[1:] : "pdf|wa",
        _STAMP[1:] : "pdf|stp", _IMAGE[1:] : "pdf|img", _TEXT[1:] : "pdf|txt", _COMPRESS[1:] : "#compress", _OCR[1:] : "#ocr",
        _ROTATE[1:] : "pdf|rotate", _FORMAT[1:] : "pdf|format", _ADD_PG[1:] : "close|dev", _DEL_PG[1:] : "#deletePg",
        _FILTER[1:] : "pdf|filter", _ZOOM[1:] : "#zoom", _HEADER[1:] : "close|dev", _FOOTER[1:] : "close|dev",
        _ADD_PGNUM[1:] : "close|dev", _LESS : "pdf", _CLOSE : "close|all" },
    "error" : _CODEC, "errorCB" : { _CODEC_CB : "error", _CLOSE : "close|all" }, "encrypt" : _ENCRYTED_FILE,}
BUTTONS = {
    "format" : { _HELP : "nabilanavab|format", "1 × 1" : "#1-format", "✌ 1 × 2 ✌" : "#2-format-H", "✌ 2 × 1 ✌" : "#2-format-V",
                 "🤟 1 × 3 🤟" : "#3-format-H", "🤟 3 × 1 🤟" : "#3-format-V", "2 × 2" : "#4-format", _BACK : "pdf" },
    "filter" : { _HELP : "nabilanavab|format", _DRAW : "#draw", _BAW : "#baw", _SAT : "#sat", _INV : "#inv", _BACK : "pdf" },
    "toImage" : { _P2IMG : "nabilanavab", _P2I : "pdf|img|img", _P2D : "pdf|img|doc", _P2Z : "pdf|img|zip", _P2T : "pdf|img|tar", _BACK : "pdf" },
    "imgRange" : { _P2IMG_ : "nabilanavab", _ALL : "#p2img|{}A", _CUSTOM : "#p2img|{}C", _BACK : "pdf|img" },
    "rotate" : { _B_ROTATE : "nabilanavab", "90°" : "#rot90", "180°" : "#rot180", "270°" : "#rot270", "360°" : "#rot360", _BACK : "pdf" },
    "txt" : { _B_TEXT : "nabilanavab", _B_TEXT_M : "#textM", "🧾 TXT 🧾" : "#textT", "🌐 HTML 🌐" : "#textH", "🎀 JSON 🎀" : "#textJ", _BACK : "pdf" },
    "type" : { _B_WATERMARK : "nabilanavab", _B_TEXT_T : "pdf|wa|txt", _IMAGE : "pdf|wa|img", _B_PDF : "pdf|wa|pdf", _BACK : "pdf" },
    "op" : { _WATER_OP : "nabilanavab", "𝟙𝟘" : "pdf|wa|{}|o01", "𝟚𝟘" : "pdf|wa|{}|o02", "𝟛𝟘" : "pdf|wa|{}|o03", "𝟜𝟘" : "pdf|wa|{}|o04",
        "𝟝𝟘" : "pdf|wa|{}|o05", "𝟞𝟘" : "pdf|wa|{}|o06", "𝟟𝟘" : "pdf|wa|{}|o07", "𝟠𝟘" : "pdf|wa|{}|o08", "𝟡𝟘" : "pdf|wa|{}|o09",
        "𝟙𝟘𝟘" : "pdf|wa|{}|o10", _BACK : "pdf|wa" },
    "po" : { _WATER_PO : "nabilanavab", _TOP : "wa|{0}|{1}|pT", _MIDDLE : "wa|{0}|{1}|pM", _BOTTOM : "wa|{0}|{1}|pB", _BACK : "pdf|wa|{0}" },
    "poTXT" : { _WATER_PO : "nabilanavab", _TOP : "pdf|wa|{0}|{1}|pT", _MIDDLE : "pdf|wa|{0}|{1}|pM", _BOTTOM : "pdf|wa|{0}|{1}|pB", _BACK : "pdf|wa|{0}" },
    "color" : { _WATER_COLOR : "nabilanavab", "᠎᠎᠎⚪️" : "#wa|{0}|{1}|{2}|W", "᠎⚫️" : "#wa|{0}|{1}|{2}|B", "᠎᠎🟤" : "#wa|{0}|{1}|{2}|C",
        "᠎🔴" : "#wa|{0}|{1}|{2}|R", "᠎᠎🟢" : "#wa|{0}|{1}|{2}|G", "🔵" : "#wa|{0}|{1}|{2}|N", "᠎᠎🟡" : "#wa|{0}|{1}|{2}|Y",
        "᠎᠎🟠" : "#wa|{0}|{1}|{2}|O", "🟣" : "#wa|{0}|{1}|{2}|V", _BACK : "pdf|wa|{0}|{1}" },
    "stamp" : { _B_STAMP : "nabilanavab", "Not For Public Release 🤧" : "pdf|stp|10", "For Public Release 🥱" : "pdf|stp|8",
        "Confidential 🤫" : "pdf|stp|2", "Departmental 🤝" : "pdf|stp|3", "Experimental 🔬" : "pdf|stp|4", "Expired 🐀" : "pdf|stp|5",
        "Final 🔧" : "pdf|stp|6", "For Comment 🗯️" : "pdf|stp|7", "Not Approved 😒" : "pdf|stp|9", "Approved 🥳" : "pdf|stp|0",
        "Sold ✊" : "pdf|stp|11", "Top Secret 😷" : "pdf|stp|12", "Draft 👀" : "pdf|stp|13", "AsIs 🤏" : "pdf|stp|1", _BACK : "pdf"},
    "stampA" : { _STAMP_COLOR : "nabilanavab", "Red ❤️" : "#spP|{}|r", "Blue 💙" : "#spP|{}|b", "Green 💚" : "#spP|{}|g", "Yellow 💛" : "#spP|{}|c1",
        "Pink 💜" : "#spP|{}|c2", "Hue 💚" : "#spP|{}|c3", "White 🤍" : "#spP|{}|c4", "Black 🖤" : "#spP|{}|c5", _BACK : "pdf|stp" }}
PROGRESS = {"progress" : _PROGRESS , "upFileCB" : {f"📤 .. {_UPLOADING} .. 📤" : "nabilanavab"}, "cbPRO_D" : ["📤 {:.2f}% 📤", _CANCEL], "cbPRO_U" : ["📤 {:.2f}% 📤", _CANCEL]}
GENERATE = {"noQueue" : _NO_QUEUE, "noImages" : _NO_IMG, "currDL" : _DL_IMG, "geting" : _GEN_PDF, "getFileNm" : _REN_PDF, "deleteQueue" : _DLT_QUEUE, "getingCB" : {_GEN_CB : "nabilanavab"},}
DOCUMENT = {
    "replyCB" : { _AIO : "aio" , _SINGLE_USE : "pdf", _CLOSE : "close|all" }, "_replyCB" : PDF_MESSAGE['pdf_button'],
    "reply" : PDF_MESSAGE['pdf'], "upFile" : _START_UPLOAD, "process" : _PROCESSING, "inWork" : _W_I_P, "big" : _BIG,
    "download" : _START_DOWNL, "refresh" : { _REFRESH : "{}" }, "dlImage" : _DL_IMG, "noAPI" : _NO_API, "error" : _ERROR,
    "takeTime" : _TAKE_TIME, "fromFile" : _CONVERT, "unsupport" : _UNSUPPORT, "cancelCB" : { _CANCEL : "close|me" }, "generate" : { _GENERATE : "generate" },
    "generateRN" : { _GENERATE : "generate", _RENAME : "generateREN" }, "setHdImg" : _HD, "setDefault" : { _BACK_DEFAULT : "close|hd" }, "useDOCKER" : _NOT_DOKR,
    "bigCB" : { _BIG_SUPP : "https://github.com/nabilanavab/ilovepdf" }, "imageAdded" : _IMG_ADDED}
AIO = {
    "true" : _TRUE, "false" : _FALSE, "aio" : _PASS_REQUIRED, "waitPASS" : _WAIT_TXT, "passMSG" : _AIO_QN,
    "aio_button" : {_HELP :"nabilanavab|aioInput", _YES:"aioInput|enc", _NO :"aioInput|dec", _MOVE :"aioInput|dec" },
    "out_button" : { _META : "nabilanavab|aio|met", _PREVIEW : "nabilanavab|aio|pre", _COMPRESS: "nabilanavab|aio|com", _B_TEXT_T : "nabilanavab|aio|txt", _ROTATE : "nabilanavab|aio|rot", _FORMAT : "nabilanavab|aio|for",
        _ENCRYPT : "nabilanavab|aio|enc", _WATERMARK : "nabilanavab|aio|wat", _RENAME : "nabilanavab|aio|rnm", _BACK : "aio", _PROCEED : "processAIO" },
    "out_values": ["aio|met|{F}", "aio|pre|{F}", "aio|com|{F}", "aio|txt|{F}", "aio|rot|{F}", "aio|for|{F}", "aio|enc|{F}", "aio|wat|{F}", "aio|rnm|{F}" ]}
gDOCUMENT = { "admin" : _ADMIN_ONLY, "notDOC" : _NOT_DOC, "Gadmin" : _G_ADMIN, "adminO" : _NOT_YOUR }
gDOCUMENT.update(DOCUMENT)
noHelp = _WASTE
URL = {
    "notPDF" : _CODEC, "close" : { _CLOSE : "close|all" }, "get" : { _GET_TG_PDF : "getFile"}, "error" : _ERROR, "view" : _VIEW_ONLY,
    "done" : _DONE, "_error_" : _TEXT_REPLY, "openCB" : {_OPEN_BROW : "{}"}, "_error" : _ERROR,"_get" : _TG_PDF }
getFILE = {
    "wait" : _CHECK, "inWork" : DOCUMENT['inWork'], "big" : _BIG, "dl" : {f"📥 ..{_DOWNLOADING}.. 📥" : "nabilanavab"},
    "up" : {f"📤 ..{_UPLOADING}..  📤" : "nabilanavab"}, "complete" : { _COMPLETED : f"{str(settings.SOURCE_CODE)}"}}
cbAns = [_NOT_DEV, _STILL_ERROR, _CANCELED, _NOT_ENCRYPT, _NOTHING_OFF , _COMPLETED ]
LINK = {
    "gen" : _GENERATING, "no" : _UNKNOWN_ERROR, "notify" : _NOTIFY, "_gen" : _URL_PROCES, "type" : _URL_TYPE,
    "notify_pvt" : { _NOTIFY_CB : "link-pvt-ntf", _MUTE_CB : "link-pvt-mut"}, "notify_pub" : { _NOTIFY_CB : "link-pbc-ntf", _MUTE_CB : "link-pbc-mut"},
    "typeBTN" : { _PUBLIC : "link-pub", _PRIVATE : "link-pvt" }, "link" : _GEN_LINK, "error" : _ERROR_ }
INDEX = {
    "rot360" : _YOUR_ERROR, "ocrError" : _OWN_RES, "notEncrypt": _NOT_ENCRYPT, "largeNo" : _MORE_PGS, "inWork" : _W_I_P, "process" : _PROCESSING,
    "pyromodASK_1" : _ASK_PASS, "pyromodASK_2" : _ASK_NAME, "pyromodASK_3" : _ASK_MERGE, "download" : _START_DOWNL, "button" : { _CANCEL : "close|me" }, "error" : _ERROR,
    "decrypt_error" : _PASS_ERROR, "cantCompress" : _CANT_COMP, "completed" : _DL_COMPLETED, "upload" : _START_UPLOAD, "encrypt_caption" : _ENCRYPT_CAPT,
    "rename_caption" : _RENAME_CAPT, "exit" : _EXIT, "compress_caption" : _COMP_CAPT, "askImage" : _ASK_PG, "pdfToImgError" : _ASK_PG_ERROR,
    "_total" : _TOTAL_PG, "_canceledAT" : _CANCEL_AT, "_upload" : _UPLOADING_AL, "finished" : _COMPLETED_SUCC, "cancelCB" : _EXIT,
    "_cancelCB" : {_CANCEL : "close|P2I"}, "_canceledCB" : {_CANCELED_CB : "close|P2IDONE"}, "_completed" : {_COMPLETED : "close|P2ICOMP"},
    "sizeLoad" : _SIZE_LOAD, "mergeDl" : _MERGE_DL, "merge" : _START_MERGE, "watermark_txt" : _WATERMARK_TXT, "watermark_pdf" : _WATERMARK_PDF,
    "watermark_img" : _WATERMARK_IMG, "adding_wa" : _ADD_WATERMARK, "readAgain" : _READ_AGAIN, "zipTAR" : _ZIP_CONVERT, "aio" : _AIO_PROCESS,}
INLINE = {
    "search" : _SEARCH, "openBot" : _OPEN_BOT, 'query' : _TOTAL, 'lang_t' : _SET_LANG, "lang_d" : _LANG, 'caption' : _INLINE_CAP,
    "lang_b" : { _SELECT_LANG : "nabilanavab" }, 'sear_t' : _SEARCH_PDF, 'sear_d' : _SEARCH_DES, 'noDB' : '🏃‍♂️🏃‍♂️', 'refer_t' : _REFER_T,
    'min' : _MIN_SEARCH, 'process' : _PROCESSING, 'nothing' : _NO_RESULT, "select" : _GET_PDF, 'description' : _INLINE_DES,
    'cbNotU' : BAN['cbNotU'], 'old' : _OLD_QUEUE, 'inWork' : _W_I_P, 'edit' : [_GET_PDF, _SEARCH_PDF, _OPEN_BOT], 'refer_d' : _REFER_D,}
BETA = {"cant": _CANT_USE, 'refer': _REFER, 'nowbeta': _NOW_BETA, 'nownotbeta': _NOW_NOT_BETA }
pdf2TXT = {
    "upload" : DOCUMENT['upFile'], "exit" : _EXIT, "nothing" : _NOTHING, "TEXT" : _TEXT2PDF, "start" : _TEXT2PDF_S,  "askC" : _TEXT2PDF_P,
    "fifteen" : { "{}" : "nabilanavab", "1" : "{}|1", "2" : "{}|2", "3" : "{}|3", "4" : "{}|4", "5" : "{}|5", "6" : "{}|6", "7" : "{}|7",
    "8" : "{}|8", "9" : "{}|9", "10" : "{}|10","11" : "{}|11", "12" : "{}|12", "13" : "{}|13", "14" : "{}|14", "15" : "{}|15", 
    _USE_DEFAULT : "{}|_"}, "askT" : _TEXT2PDF_T, "size_btn" : {_SELECT_SCALE : "nabilanavab", "1" : "t2p|1", "2" : "t2p|2", _CLOSE : "close|me"},
    "six_" : { "{}" : "nabilanavab", "1" : "{}|1:", "2" : "{}|2:", "3" : "{}|3:", "4" : "{}|4:", "5" : "{}|5:", "+" : "{}|6:", _USE_DEFAULT : "{}|_:"},
    "six" : { "{}" : "nabilanavab", "1" : "{}|1", "2" : "{}|2", "3" : "{}|3", "4" : "{}|4", "5" : "{}|5", "6" : "{}|6", _USE_DEFAULT : "{}|_"},
    "error" : _ERROR }
HELP = {}

# If you have any questions or suggestions, please feel free to reach out.
# Together, we can make this project even better, Happy coding!  XD
