# copyright ©️ 2021 nabilanavab
file_name = "lang/eng.py"

from configs.config   import settings


_CLOSE = "🚶 बंद 🚶"
_RESTART = "☠ `𝐎𝐕𝐄𝐑𝐋𝐎𝐀𝐃 𝐃𝐄𝐂𝐓𝐄𝐂𝐓𝐄𝐃`☠:\n__𝐬𝐞𝐫𝐯𝐞𝐫 𝐫𝐞𝐬 𝐭𝐚𝐫𝐭𝐞𝐝__ \n\nमैंने देखा कि आपका काम भी कतार में था\n\nक्या आप दोबारा कोशिश कर सकते हैं..!"
_SETTINGS = "⚙️ सेटिंग्स ⚙️"
_LANGUAGE = "🌍 भाषा 🌍"
_HELP = "⚠️ मदद ⚠️"
_CHANNEL = "📢 चैनल 📢"
_SOURCE = "🌟 स्रोत कोड 🌟"
_ADD_GROUP = "➕ ग्रुप में जोड़ें ➕"
_THUMB = "थंबनेल"
_NAME = "नाम"
_API = "एपीआई"
_CAPTION = "कैप्शन"
_BACK_HOME = "   घर वापिस जा रहा हूँ"
_INSTRUCTIONS = "🛈 निर्देश 🛈"
_HOME_A = "अरे {}..!!\n{} में आपका स्वागत है.!\n\nइस टूल के साथ, आप छवियों को आसानी से पीडीएफ में बदल सकते हैं, पीडीएफ फाइलों को कंप्रेस कर सकते हैं, विभाजित कर सकते हैं, मर्ज कर सकते हैं, पीडीएफ को एन्क्रिप्ट या डिक्रिप्ट कर सकते हैं, पीडीएफ पेजों को घुमा सकते हैं, और बहुत कुछ कर सकते हैं। \n\nबस मुझे एक PDF/इमेज भेजें और यह अनुरोधित कार्रवाई करेगा। मदद के लिए किसी भी समय '⚠️ HELP ⚠️' चुनें। पीडीएफ बॉट आपके जीवन को आसान बनाने के लिए यहां है..\n\nइसे अभी आज़माएं और देखें कि यह आपकी सभी पीडीएफ जरूरतों में आपकी मदद कैसे कर सकता है!"
_HOME_B = "सेटिंग पृष्ठ ⚙️\n\nउपयोगकर्ता का नाम: {}\nउपयोगकर्ता आईडी: {}\nउपयोगकर्ता नाम: {}\nशामिल होने की तिथि: {}\n\nभाषा: {}\nAPI: {}\nTHUMB: {}\nCAPTION: {} \nफ़ाइल का नाम : {}"
_HOME_C = "**कुछ मुख्य विशेषताएं हैं:**\n\n ◍ ```अपनी छवियों से एक पीडीएफ बनाएं: बस इसे बॉट पीएमएस में भेजें [png, jpg, jpeg]``\n ◍ ```निकालें पीडीएफ से पाठ: पीडीएफ फाइल से पाठ निकालने और अलग संदेश के रूप में भेजने में मदद करता है। ``\n ◍ ``` पीडीएफ को अन्य फ़ाइल प्रारूप में परिवर्तित करें: [images, txt, html, json, tar, rar] ``\n ◍ ```एक से अधिक PDF को एक में मिलाएं: एकाधिक PDF फ़ाइलों को एक फ़ाइल में संयोजित करने के लिए```\n ◍ ```एक PDF को अलग-अलग पृष्ठों में विभाजित करें: इसे अलग-अलग पृष्ठों में विभाजित करने के लिए बड़ी PDF फ़ाइल` ``\n ◍ ```पीडीएफ से छवियां निकालें: [सभी,श्रेणी,पृष्ठ] छवि, दस्तावेज़, ज़िप, रार के रूप में```\n ◍ ```छवियों को अनुकूलित करके आकार कम करने में मदद करता है। फ़ाइल बहुत बड़ी होने पर ईमेल के माध्यम से भेजने में उपयोगी``\n ◍ ```मेटाडेटा प्राप्त करता है: दस्तावेज़ का शीर्षक, लेखक, विषय, दस्तावेज़ से जुड़े कीवर्ड, और निर्माण और संशोधन दिनांक```\n ◍ ``` पासवर्ड का उपयोग करके पीडीएफ़ को एन्क्रिप्ट/डिक्रिप्ट करें, पीडीएफ़ के लिए वेबसाइटें, घुमाएँ, नाम बदलें, स्टैंब करें..```\n ◍ ```वाटरमार्क, संयोजन, ज़ूम, ड्रा, पृष्ठ जोड़ें/हटाएं, ओसीआर पीडीएफ..` ``\n ◍ ```पीडीएफ फाइलों के लिए पाठ संदेश, और भी बहुत कुछ.. 😎```"
_HOME_D = "`जैसा कि आप जानते हैं, यह एक मुफ्त सेवा है, मैं गारंटी नहीं दे सकता कि मैं इस सेवा को कितने समय तक बनाए रख सकता हूं..`😝\n\n ⚠️ निर्देश ⚠️:\n ◍ ```कृपया ध्यान दें कि स्पैमिंग आमतौर पर बर्दाश्त नहीं की जाती है और इसका परिणाम हो सकता है उपयोगकर्ता या बॉट को सेवा से प्रतिबंधित किया जा रहा है ```\n ◍ ``` फ़ाइल को संसाधित करने के लिए बॉट की प्रतीक्षा करें: बॉट पीडीएफ फ़ाइल को संसाधित करेगा और अनुरोधित कार्रवाई करेगा। फ़ाइल के आकार और की जा रही कार्रवाई की जटिलता के आधार पर इसमें कुछ मिनट लग सकते हैं। ```\n ◍ ```एक बार जब बॉट कार्रवाई पूरी कर लेता है, तो यह आपको परिणाम भेजेगा। यदि कार्रवाई सफल रही, तो आपको आउटपुट प्राप्त होगा। यदि कार्रवाई सफल नहीं होती है, तो बॉट आपको बताएगा और कोई भी प्रासंगिक त्रुटि संदेश प्रदान करेगा। एन ** शुरू करने के लिए कोई छवि भेजें: ** 😁"
_SELECT_LANG = "अब, कोई भी भाषा चुनें.."
_DEFAULT = "डिफ़ॉल्ट ❌"
_CUSTOM = "कस्टम ✅"
_CANT_USE = "इस सुविधा का उपयोग नहीं किया जा सकता ❌"
_WAIT = "प्रतीक्षा.. 🥱"
_REPORT = "आपको मिलने वाले किसी भी बग की रिपोर्ट करें!"
_ADD = "♻ जोड़ें ♻"
_CHANGE = "♻ बदलें ♻"
_DELETE = "🗑 हटाएं 🗑"
_SET_THUMB = "सेटिंग ⚙️ » थंबनेल 📷"
_SET_NAME = "सेटिंग ⚙️ » फ़ाइल का नाम 📷"
_SET_API = "सेटिंग ⚙️ »एपीआई 📷"
_SET_CAPT = "सेटिंग ⚙️ »कैप्शन 📷"
_SET_LANG = "सेटिंग ⚙️ » भाषा बदलें 🌐"
_SEND = "अब, मुझे भेजें.."
_SEND_FAST = "अब, मुझे भेजो.. 😅\n\nजल्दी.! मेरे पास टेक्स्ट पर जाने के लिए और समय नहीं है.. 😏\n\n/रद्द करें: रद्द करने के लिए"
_ASK_API = "\n\n**नीचे** लिंक खोलें और मुझे गुप्त कोड भेजें:"
_LANG_FEED = "बग चेतावनी! यदि मेरे टेक्स्ट अजीब लगते हैं, तो यह संभवतः Google अनुवाद की गलती है।"
_RES_SUCCESS = "सेटिंग्स सफलतापूर्वक अपडेट की गईं ✅"
_RES_FAIL = "सेटिंग्स को अपडेट नहीं किया जा सकता ❌"
_OPEN_BROW = "🔗 ब्राउज़र 🔗 में खोलें"
_ERROR_DB = "डेटाबेस से डेटा पुनर्प्राप्त करते समय कुछ गड़बड़ी हुई"
_START = "स्वागत संदेश.."
_TXT2PDF = "टेक्स्ट पीडीएफ बनाएं"
_FEEDBACK = "प्रतिक्रिया लिखें 📋"
_PG_NUM = "`पृष्ठों की संख्या: •{}•` 🌟"
_PDF_REPLY = "`मुझे इस फ़ाइल के साथ क्या करना चाहिए?`\n\nफ़ाइल का नाम: `{}`\nफ़ाइल का आकार: `{}`"
_META = "⭐ मेटा £ डेटा ⭐"
_IMAGE = "🖼️ छवियां 🖼️"
_TEXT = "📑 पाठ 📑"
_ROTATE = "🤸 घुमाएँ 🤸"
_SPLIT_MERGE = "✂️ स्प्लिट/मर्ज 🧬"
_ENC_DECRYPT = "🔐 प्रवेश/निर्णय 🔓"
_FORMAT = "😗 प्रारूप 😗"
_WATERMARK = "💦 वॉटरमार्क 💦"
_COMP_OCR = "🗜 सेक/ओसीआर 🔎"
_RENAME = "✏️ नाम बदलें ✏️"
_ZOOM = "🔎 ज़ूम 🔎"
_URL = "🔗 यूआरएल 🔗"
_FILTER = "👻 फिल्टर 👻"
_ADD_DELETE = "🟢 जोड़ें/डीएलटी 🔴"
_CODEC = "__मैं इस फ़ाइल के साथ कुछ नहीं कर सकता.__ 😏\n\n🐉 `कोडेक त्रुटि` 🐉"
_CODEC_CB = "❌ कोडेक में त्रुटि ❌"
_ENCRYTED_FILE = "`फ़ाइल एन्क्रिप्टेड है` 🔐\n\nफ़ाइल का नाम: `{}`\nफ़ाइल का आकार: `{}`"
_DECRYPT_CB = "🔓 डिक्रिप्ट 🔓"
_ENCRYPT_CB = "🔐 एनक्रिप्ट 🔐"
_REASON = "\n\nकारण: {}"
_BAN = "हे {}\n\nकिसी कारण से आप इस बॉट का उपयोग नहीं कर सकते :("
_BAN_G = "{}मुझसे कभी भी अच्छी प्रतिक्रिया की उम्मीद न करें\n\nएडमिन ने मुझे यहां काम करने से प्रतिबंधित कर दिया है.. 🤭"
_BAN_CB = "ओह, आपका दिल तोड़ने के लिए क्षमा करें, यह संदेश आपके लिए नहीं है 💔.\n\nअगली बार शुभकामनाएँ! 😏"
_FOOL = "प्लीज मुझे बेवकूफ बनाने की कोशिश मत करो.. 🤭"
_CREATE_BOT = "अपना खुद का बॉट बनाएं"
_FORCE = "प्रतीक्षा करें [{}](tg://user?id={})..!!\n\nभारी ट्रैफ़िक के कारण केवल **चैनल के सदस्य** ही इस बॉट का उपयोग कर सकते हैं 🚶\nइसका मतलब है कि आपको ** मेरा उपयोग करने के लिए ** नीचे दिए गए चैनल से जुड़ें!"
_JOIN_CHANNEL =  "🌟 चैनल 🌟 से जुड़ें"
_REFRESH = "♻️ रिफ्रेश ♻️"
_BACK = "   पीछे"
_H_META = "मेटा £ डेटा: मदद ❓"
_H_ENC = "❓ एनक्रिप्ट / डिक्रिप्ट: सहायता ❓"
_ONLY_META = "✔ केवल मेटाडेटा ✔"
_ALL_META = "✅ पूर्वावलोकन के साथ ✅"
_H_SPLIT_MERGE = "❓ स्प्लिट / मर्ज पीडीएफ: हेल्प ❓"
_H_SPLIT = "✂️ विभाजित ✂️"
_H_MERGE = "🧬 विलय 🧬"
_H_FORMAT = "❓ प्रारूप: सहायता ❓"
_H_COMP_OCR = "❓ कंप्रेस/ओसीआर पीडीएफ: हेल्प ❓"
_H_COMPRESS = "🗜 कंप्रेस 🗜"
_H_OCR = "📝 ओसीआर 📝"
_H_WATERMARK = "❓ वॉटरमार्क: मदद ❓"
_H_WATER = "💦 वॉटरमार्क 💦"
_H_STAMP = "™️ स्टैम्प ™️"
_H_FILTER = "❓ फ़िल्टर: सहायता ❓"
_H_DRAW = "🎨 ड्रा 🎨"
_H_BAW = "⚫ काला/सफेद ⚪"
_H_SAT = "🪐सतुररे 🪐"
_H_INV = "🖌 पलटें 🖌"
_H_ADD_DEL = "❓ पृष्ठ जोड़ें/हटाएं: सहायता ❓"
_ADD = "🟢 पेज जोड़ें 🟢"
_DEL = "🔴 पृष्ठों को हटाएं 🔴"
_P2IMG = "⚙️ पीडीएफ » छवियां ↓"
_P2IMG_ = "⚙️ पीडीएफ » छवियां » {} ↓"
_P2I = "🖼 आईएमजी 🖼"
_P2D = "📂 डॉक्टर 📂"
_P2Z = "🤐 ज़िप 🤐"
_P2T = "🎯 तार 🎯"
_ALL = "🙄 सभी 🙄"
_CUSTOM = "🤧 कस्टम 🤧"
_B_ROTATE = "⚙️ पीडीएफ » घुमाएँ ↓"
_B_TEXT = "⚙️ पीडीएफ » TXT ↓"
_B_TEXT = "📜 संदेश 📜"
_B_WATERMARK = "⚙️ पीडीएफ » वॉटरमार्क ↓"
_B_TEXT_T = "💬 पाठ 💬"
_B_PDF = "📎 पीडीएफ 📎"
_WATER_OP = "⚙️ पीडीएफ » वॉटरमार्क » {} » ओपीसीसिटी ↓"
_WATER_PO = "⚙️ पीडीएफ » वॉटरमार्क » स्थिति ↓"
_TOP = "⬆️ शीर्ष ⬆️"
_MIDDLE = "↔️ मध्यम ↔️"
_BOTTOM = "⬇️ बॉटम ⬇️"
_WATER_COLOR = "⚙️ पीडीएफ »वाटरमार्क» CoLoR↓"
_B_STAMP = "⚙️ पीडीएफ »स्टैम्प ↓"
_STAMP_COLOR = "⚙️ पीडीएफ »स्टाम्प» रंग↓"
_PROGRESS = "\n**पूर्ण ✅ : **{0}/{1}\n**गति 🚀:** {2}/s\n**अनुमानित समय ⏳:** {3}"
_UPLOADING = "अपलोड हो रहा है"
_CANCEL = "🎯 रद्द करें 🎯"
_NO_QUEUE = "`कोई कतार नहीं मिली..`😲"
_NO_IMG = "कोई चित्र नहीं मिला.!! 😒"
_DL_IMG = "डाउनलोड की गई {} छवियां 🥱"
_GEN_PDF = "फ़ाइल का नाम: `{}`\nपृष्ठ: `{}`"
_REN_PDF = "अब मुझे एक फ़ाइल नाम भेजें 😒:"
_DLT_QUEUE = "`कतार सफलतापूर्वक हटा दी गई..`🤧"
_GEN_CB = "📚 पीडीएफ बनाना .."
_AIO = "😏 सभी एक 😏 में"
_SINGLE_USE = "😎 सिंगल यूज 😎"
_START_UPLOAD = "अपलोड करना शुरू किया..`📤"
_START_DOWNL = "`आपकी फाइल डाउनलोड हो रही है..` 📥"
_PROCESSING = "⚙️ संसाधित हो रहा है.."
_W_I_P = "कार्य प्रगति पर है.. 🙇"
_DL_IMG = "`अपनी छवि डाउनलोड कर रहा है..⏳`"
_TAKE_TIME = "```⚙️ कार्य प्रगति पर है..\nइसमें कुछ समय लग सकता है..```💛"
_CONVERT = "`रूपांतरित: {} से {}`"
_UNSUPPORT = "असमर्थित फ़ाइल..🙄`"
_ADMIN_ONLY = "कुछ टेलीग्राम सीमाओं के कारण..\n\nमैं केवल एक व्यवस्थापक के रूप में काम कर सकता हूं\n__कृपया मुझे व्यवस्थापक के रूप में पदोन्नत करें__ ☺️"
_NOT_DOC = "भाई कृपया किसी दस्तावेज़ या छवि का उत्तर दें..🤧"
_G_ADMIN = "केवल समूह व्यवस्थापक ही इस बॉट का उपयोग कर सकते हैं\nवरना मेरे पीएम 😋 पर आएं"
_NOT_YOUR = "`केवल व्यवस्थापक इसे कर सकते हैं..\n\nया अपने pdfs पर प्रयास करें(__आपके संदेश का उत्तर__)"
_WASTE = "'कोई भी आपकी मदद नहीं करेगा' 😏"
_GENERATE ="📚 उत्पन्न 📚"
_HD = "अब Image To PDF HD मोड में है 😈"
_BACK_DEFAULT = "   डिफ़ॉल्ट गुणवत्ता पर वापस"
_NO_API = "`कृपया कन्वर्ट एपीआई जोड़ें .. 💩\n\nशुरू » सेटिंग्स » एपीआई » जोड़ें/बदलें`"
_ERROR = "कुछ गलत हो गया.. 🐉\n\nERROR: `{}`"
_NOT_DOKR = "`फ़ाइल समर्थित नहीं है, डॉकर का उपयोग करके बॉट परिनियोजित करें`"
_BIG = "ओवरलोड के कारण, स्वामी {}पीडीएफ़ फ़ाइलों के लिए एमबी सीमित करता है 🙇\n\n`कृपया मुझे {}एमबी आकार` से कम फ़ाइल भेजें 🙃"
_BIG_SUPP = "💎 2Gb सपोर्ट बॉट बनाएं 💎"
_IMG_ADDED = "`आपके PDF में {} पेज जोड़े गए..`🤓\n\nfileName: `{}.pdf`"
_TRUE = "✅ सच ✅"
_FALSE = "🔴 झूठा 🔴"
_PASS_REQUIRED = "क्या पीडीएफ फाइल को खोलने के लिए पासवर्ड की जरूरत होती है?🤔💭\n\nफाइल का नाम : `{}`\nफाइल का आकार : `{}`"
_H_AIO = "❓ इनपुट फ़ाइल: सहायता ❓"
_YES = "✅ हाँ ✅"
_NO = "🔴 नहीं 🔴"
_MOVE = "⏭ हटो ⏭"
_WAIT_TXT = "अब मुझे कोई टेक्स्ट संदेश भेजें .. 😪"
_AIO_QN = "`मुझे इस फाइल का क्या करना चाहिए? |\n\nआउटपुट:\n	फ़ाइल का नाम : `•{}•`\n	वॉटरमार्क : `•{}•`\n	पासवर्ड : ||•{}•||"
_PREVIEW = "📸 पूर्वावलोकन 📸"
_PROCEED = "🆗 प्रक्रिया 🆗"
_EXIT = "`प्रक्रिया रद्द..` 😏"
_NOTHING = "बनाने के लिए कुछ नहीं.. 😏"
_TEXT2PDF = "`टेक्स्ट संदेशों से पीडीएफ बनाएं »`"
_TEXT2PDF_S = "txt को Pdf में कनवर्ट करना शुरू कर दिया है..🎉"
_TEXT2PDF_T = "__टेक्स्ट टू पीडीएफ़ » अब, कृपया एक शीर्षक दर्ज करें:__\n\n/बाहर निकलें __रद्द करने के लिए__\n/छोड़ें __छोड़ने के लिए__"
_TEXT2PDF_P = "__PDF में टेक्स्ट » अब, कृपया पैराग्राफ दर्ज करें {}:__\n\n/exit __to cancel__\n/create __to create__"
_GET_TG_PDF = "🧭 पीडीएफ फाइल प्राप्त करें 🧭"
_DONE = "```लगभग हो गया.. ✅\nअब, अपलोड करना शुरू कर दिया है.. 📤```"
_TEXT_REPLY = "मुझे कोई url या डायरेक्ट टेलीग्राम pdf लिंक भेजें"
_TG_PDF = "[चैट खोलें]({})\n\n**चैट के बारे में ↓**\nचैट प्रकार: {}\nचैट का नाम: {}\nचैट Usr: @{}\nचैट आईडी: {}\nतारीख: {}\n**मीडिया के बारे में ↓**\nमीडिया : {}\nफ़ाइल का नाम : {}\nफ़ाइल का आकार : {}\nफ़ाइल का प्रकार : {}"
_CHECK = "रुको.. मुझे.. 😜"
_DOWNLOADING = "डाउनलोड किया जा रहा"
_COMPLETED = "😎 पूर्ण 😎"
_NOT_DEV = "यह फीचर अंडर डेवलपमेंट ⛷️ है"
_STILL_ERROR = "एरर एनन परांजिल.. तो क्या.. 😏"
_CANCELED = "प्रक्रिया रद्द.. 😏"
_NOT_ENCRYPT = "फ़ाइल एनक्रिप्टेड नहीं है.. 👀"
_NOTHING_OFF = "इसके बारे में कुछ भी आधिकारिक नहीं है .. 😅"
_SEARCH = "️♻️ खोज ♻️"
_OPEN_BOT = "😇 बॉट 😇 में खोलें"
_TOTAL = "कुल {} परिणाम.."
_H_LANG = "आपकी सहज भाषा 😇 सेट करने में मदद मिलती है"
_SEARCH_PDF = "पीडीएफ खोजें 🔍"
_SEARCH_DES = "अब आप PDF दस्तावेज़ों की विशाल लाइब्रेरी में आसानी और सुविधा के साथ खोज कर सकते हैं। इनलाइन खोज मोड का उपयोग करके, आप केवल उस दस्तावेज़ का नाम टाइप कर सकते हैं जिसे आप ढूंढ रहे हैं"
_MIN_SEARCH = "🔎 पीडीएफ फाइलों को खोजने के लिए टाइप करें .."
_NO_RESULT = "🤐 '{}' के लिए कोई परिणाम नहीं"
_GET_PDF = "⚔ पीडीएफ ⚔ प्राप्त करें"
_OLD_QUEUE = "पुरानी कतार.. नई कोशिश करें.. 🙄"
_INLINE_CAP = "MD5: {}\nशीर्षक: **{}.**\nलेखक: **{}.**\n\nवॉल्यूम: {}\nवर्ष: {}\nपृष्ठ: {}\nभाषा: {}\nप्रकाशक: {}"
_INLINE_DES = "लेखक: {}\nवॉल्यूम: {} वर्ष: {} पेज: {}\nभाषा: {} एक्सटेंशन: {}\nप्रकाशक: {}"
_DL_COMPLETED = "`डाउनलोडिंग पूर्ण..` ✅\n\n```संसाधन प्रारंभ हो गया\nइसमें कुछ समय लग सकता है..``` 🙇📝"
_PASS_ERROR = "क्षमा करें, पीडीएफ फाइल को डिक्रिप्ट करने के लिए यह पासवर्ड अमान्य है"
_CANT_COMP = "अधिक 🙂 संपीड़ित नहीं कर सकता"
_ASK_NAME = "पीडीएफ नया नाम दर्ज करें:\n\n/रद्द करने के लिए बाहर निकलें"
_ASK_MERGE = "__MERGE pdfs » कतार में कुल PDF: {}\n\n/रद्द करने के लिए बाहर निकलें\n/मर्ज करने के लिए मर्ज करें__"
_ASK_PASS = "_पीडीएफ {} »\nअब, कृपया पासवर्ड दर्ज करें:__\n\n/बाहर निकलें __रद्द करने के लिए__"
_ASK_PG = "कृपया पीडीएफ पेज सिंटैक्स दर्ज करें जिसका आप उपयोग करना चाहते हैं,\n\nसिंटैक्स:\n	पेज की रेंज: `[प्रारंभ, अंत]`,\n	विशिष्ट पेज: `अल्पविराम से अलग'।\n\nउदाहरण: `1,3,5,12:19`"
_ASK_PG_ERROR = "`पृष्ठ संख्या के लिए अमान्य सिंटैक्स`\n`NB: Pdf में केवल {} पृष्ठ` ⭐ हैं। ."
_MORE_PGS = "इसमें बहुत अधिक पृष्ठ हैं, मुझे 5 पृष्ठों से कम की एक pdf भेजें 😐"
_YOUR_ERROR = "आपको कोई बड़ी समस्या है..🙂"
_OWN_RES = "मालिक प्रतिबंधित 😎🤏"
_ENCRYPT_CAPT = "__पृष्ठ संख्या__: {}\n__कुंजी__ 🔐: ||{}||"
_RENAME_CAPT = "पुराना नाम: `{}`\nनया नाम: `{}`"
_COMP_CAPT = "पुरानी फ़ाइल का आकार: `{}`\nनई फ़ाइल का आकार: `{}`\nअनुपात: `{}`%"
_COMPLETED_SUCC = "सफलतापूर्वक पूरा। 😎"
_CANCELED_CB = "🍄 रद्द 🍄"
_TOTAL_PG = "`कुल पृष्ठ: {}..⏳`"
_CANCEL_AT = "{}/{} पृष्ठों पर रद्द किया गया..` 🙄"
_UPLOADING_AL = "`अपलोड हो रहा है: {}/{} पेज.. 🐬`"
_SIZE_LOAD = "`ओवरलोड के कारण बॉट केवल %sMb PDF को सपोर्ट करता है.."
_MERGE_DL = "`डाउनलोड हो रहा है {}`"
_START_MERGE = "`मर्ज करना शुरू किया {} pdfs`"
_WATERMARK_TXT = "__अब, मुझे एक पाठ संदेश भेजें__\n\n/निकास : रद्द करने के लिए"
_WATERMARK_PDF = "__मुझे वॉटरमार्क पीडीएफ भेजें।__\n\n/बाहर निकलें: रद्द करने के लिए"
_WATERMARK_IMG = "__ मुझे वॉटरमार्क छवि फ़ाइल के रूप में भेजें__\n__ समर्थित फ़ाइलें [png, jpeg, jpg]__\n\n/exit : रद्द करने के लिए"
_ADD_WATERMARK = "पीडीएफ फाइल में वॉटरमार्क जोड़ना 😎"
_READ_AGAIN = "कृपया इस संदेश को फिर से पढ़ें.. 🥴😲"
_ZIP_CONVERT = "`परिवर्तित {}/{}` 😎"
_GENERATING = "`🔗 पैदा कर रहा है..`"
_UNKNOWN_ERROR = "दुर्भाग्य से, हमें एक त्रुटि 😓 का सामना करना पड़ा"
_NOTIFY = "जब कोई इस पीडीएफ को लाए तो सूचित करें"
_URL_PROCES = "```🔗 जनरेट हो रहा है..\nहम इस पर काम कर रहे हैं!\n\nप्रोसेसिंग को पूरा होने के लिए कृपया कुछ समय दें.```"
_URL_TYPE = "`🔗 जनरेट हो रहा है..`\n\n**सार्वजनिक** 📢:\n__इस लिंक के ज़रिए एक्सेस की गई फ़ाइल सार्वजनिक रूप से उपलब्ध होगी, जिससे कोई भी इसे सेव और फ़ॉरवर्ड कर सकेगा__.\n\n**प्रोटेक्ट** 🔐:\n__सुनिश्चित करता है अग्रेषण और बचत__ को रोककर संदेश की गोपनीयता।"
_NOTIFY_CB = "🔔 सूचित करें 🔔"
_MUTE_CB = "🔕 म्यूट 🔕"
_PUBLIC = "📢 सार्वजनिक 📢"
_PRIVATE = "🔐 निजी 🔐"
_GEN_LINK = "**यह रहा! आप यही खोज रहे थे..**"
_ERROR_ = "ओह, ऐसा लगता है कि कुछ गलत हो गया है. कृपया बाद में पुन: प्रयास करें.\n\n`ERROR:` {}"



RESTART = { "msg" : _RESTART, "btn" : { _CLOSE : "close|mee" }}
HOME = {
    "HomeA" : _HOME_A, "HomeB" : _HOME_B, "HomeC" : _HOME_C, "HomeD" : _HOME_D, "search" : _SEARCH_PDF,
    "HomeACB" : { _SETTINGS : "Home|B", _LANGUAGE : "set|lang", _HELP : "Home|C", _CHANNEL : f"{str(settings.OWNED_CHANNEL)}",
                 _SOURCE : f"{str(settings.SOURCE_CODE)}", _ADD_GROUP : "https://t.me/{}?startgroup=True" },
    "HomeAdminCB" : { _SETTINGS : "Home|B", _LANGUAGE : "set|lang", _HELP : "Home|C",
        "🗽 STATUS 🗽" : f"status|home", _ADD_GROUP : "https://t.me/{}?startgroup=True", _CLOSE : "close|mee" },
    "HomeBCB" : { _THUMB : "set|thumb", _NAME : "set|fname", _API : "set|api", _CAPTION : "set|capt", _BACK_HOME : "Home|B2A" },
    "HomeCCB" : { _BACK_HOME : "Home|A", _INSTRUCTIONS : "Home|D" }, "HomeDCB" : { _HELP : "Home|C", _BACK_HOME : "Home|A" } }
HomeG = { "HomeACB" : { _LANGUAGE : "set|lang", _HELP : "Home|C", _CHANNEL : f"{str(settings.OWNED_CHANNEL)}",
    _SOURCE : f"{settings.SOURCE_CODE}", _CLOSE : "close|mee" }, "HomeA" : _HOME_A}
SETTINGS = {
    "lang" : _SELECT_LANG, "default" : [_DEFAULT, _CUSTOM], "cant" : _CANT_USE, "wait" : { _WAIT : "nabilanavab" },
    "feedbtn" : { _REPORT : settings.REPORT }, "chgLang" : { _SET_LANG : "nabilanavab"}, "askApi" : _ASK_API,
    "result" : [_RES_FAIL, _RES_SUCCESS], "waitApi" : { _OPEN_BROW : "https://www.convertapi.com/a/signin" }, "error" : _ERROR_DB,
    "back" : [{ _BACK_HOME : "Home|B2S" }, { _BACK_HOME : "Home|B2A" }], "feedback" : _LANG_FEED, "ask" : [_SEND, _SEND_FAST],
    "thumb" : [{ _SET_THUMB : "nabilanavab", _ADD : "set|thumb+", _BACK_HOME : "Home|B"},
               { _SET_THUMB : "nabilanavab", _CHANGE : "set|thumb+", _DELETE : "set|thumb-", _BACK_HOME : "Home|B2S"}],
    "fname" : [{ _SET_NAME : "nabilanavab", _ADD : "set|fname+", _BACK_HOME : "Home|B2S"},
               {_SET_NAME : "nabilanavab", _CHANGE : "set|fname+", _DELETE : "set|fname-", _BACK_HOME : "Home|B2S"}],
    "api" : [{ _SET_API : "nabilanavab", _ADD : "set|api+", _BACK_HOME : "Home|B2S"},
             { _SET_API : "nabilanavab", _CHANGE : "set|api+", _DELETE : "set|api-", _BACK_HOME : "Home|B2S"}],
    "capt" : [{ _SET_CAPT : "nabilanavab", _ADD : "set|capt+", _BACK_HOME : "Home|B2S"},
              { _SET_CAPT : "nabilanavab", _CHANGE : "set|capt+", _DELETE : "set|capt-", _BACK_HOME : "Home|B2S"}] }
BOT_COMMAND = { "start" : _START, "txt2pdf" : _TXT2PDF }
STATUS_MSG = {
    "_HOME" : {
        "📊 ↓ SERVER ↓ 📊" : "nabilanavab", "📶 STORAGE 📶" : "status|server", "🥥 DATABASE 🥥" : "status|db",
        "🌝 ↓ GET LIST ↓ 🌝": "nabilanavab", "💎 ADMIN 💎" : "status|admin", "👤 USERS 👤" : "status|users", _BACK_HOME : "Home|A"
    },
    "DB" : """📂 DATABASE :\n\n**◍ Database Users :** `{}` 📍\n**◍ Database Chats :** `{}` 📍""",
    "SERVER" : "**◍ Total Space     :** `{}`\n**◍ Used Space     :** `{}({}%)`\n**◍ Free Space      :** `{}`\n**◍ CPU Usage      :** `{}`%"
               "**◍ RAM Usage     :** `{}`%\n**◍ Current Work  :** `{}`\n**◍ Message Id     :** `{}`",
    "USERS" : "Users in Database are.", "NO_DB" : "No dataBASE set Yet 💩", "ADMIN" : "**Total ADMIN:** __{}__\n",
    "BACK" : { _BACK_HOME : "status|home" }, "HOME" : "`Now, select any option below to get current STATUS 💱.. `",}
feedbackMsg = f"[{_FEEDBACK}]({settings.FEEDBACK})"
BAN = {
    "UCantUse" : _BAN, "UCantUseDB" : _BAN + _REASON, "GroupCantUse" : _BAN_G, "GroupCantUseDB" : _BAN_G + _REASON,
    "cbNotU" : _BAN_CB, "Fool" : _FOOL, "Force" : _FORCE, "ForceCB" : { _JOIN_CHANNEL : "{0}", _REFRESH : "refresh{1}" },
    "banCB" : {_CREATE_BOT : f"{settings.SOURCE_CODE}", _SOURCE : f"{settings.SOURCE_CODE}", _CHANNEL : "https://t.me/ilovepdf_bot"}}
PDF_MESSAGE = {
    "pg" : _PG_NUM , "pdf" : _PDF_REPLY, "encryptCB" : { _DECRYPT_CB : "#decrypt", _CLOSE : "close|all" },
    "pdf_button" : { _META : "pdf|meta", _IMAGE : "pdf|img", _TEXT : "pdf|txt", _ROTATE : "pdf|rotate", _SPLIT_MERGE : "pdf|trim",
        _ENC_DECRYPT : "pdf|lock", _FORMAT : "pdf|format", _WATERMARK : "pdf|trade", _COMP_OCR : "pdf|comocr",
        _RENAME : "#rename", _ZOOM : "#zoom", _URL : "link", _FILTER : "pdf|filter", _ADD_DELETE : "pdf|addlt", _CLOSE : "close|all"},
    "error" : _CODEC, "errorCB" : { _CODEC_CB : "error", _CLOSE : "close|all" }, "encrypt" : _ENCRYTED_FILE,}
BUTTONS = {
    "meta" : { _H_META : "nabilanavab|meta", _ONLY_META : "#metadata", _ALL_META : "#preview", _BACK : "pdf" },
    "lock" : { _H_ENC : "nabilanavab|lock", _ENCRYPT_CB : "#encrypt", _DECRYPT_CB : "#decrypt", _BACK : "pdf" },
    "trim" : { _SPLIT_MERGE : "nabilanavab|trim", _H_SPLIT : "#split", _H_MERGE : "#merge", _BACK : "pdf" },
    "format" : { _H_FORMAT : "nabilanavab|format", "1 × 1" : "#1-format", "✌ 1 × 2 ✌" : "#2-format-H", "✌ 2 × 1 ✌" : "#2-format-V",
                 "🤟 1 × 3 🤟" : "#3-format-H", "🤟 3 × 1 🤟" : "#3-format-V", "2 × 2" : "#4-format", _BACK : "pdf" },
    "comocr" : { _H_COMP_OCR : "nabilanavab|comocr", _H_COMPRESS : "#compress", _H_OCR : "#ocr", _BACK : "pdf" },
    "trade" : { _H_WATERMARK : "nabilanavab|trade", _H_WATER : "pdf|wa", _H_STAMP : "pdf|stp", _BACK : "pdf" },
    "filter" : { _H_FILTER : "nabilanavab|format", _H_DRAW : "#draw", _H_BAW : "#baw", _H_SAT : "#sat", _H_INV : "#inv", _BACK : "pdf" },
    "addlt" : { _H_ADD_DEL : "nabilanavab|add", _ADD : "close|dev", _DEL : "#deletePg", _BACK : "pdf" },
    "toImage" : { _P2IMG : "nabilanavab", _P2I : "pdf|img|img", _P2D : "pdf|img|doc", _P2Z : "pdf|img|zip", _P2T : "pdf|img|tar", _BACK : "pdf" },
    "imgRange" : { _P2IMG_ : "nabilanavab", _ALL : "#p2img|{}A", _CUSTOM : "#p2img|{}C", _BACK : "pdf|img" },
    "rotate" : { _B_ROTATE : "nabilanavab", "90°" : "#rot90", "180°" : "#rot180", "270°" : "#rot270", "360°" : "#rot360", _BACK : "pdf" },
    "txt" : { _B_TEXT : "nabilanavab", _B_TEXT : "#textM", "🧾 TXT 🧾" : "#textT", "🌐 HTML 🌐" : "#textH", "🎀 JSON 🎀" : "#textJ", _BACK : "pdf" },
    "type" : { _B_WATERMARK : "nabilanavab", _B_TEXT_T : "pdf|wa|txt", _IMAGE : "pdf|wa|img", _B_PDF : "pdf|wa|pdf", _BACK : "pdf|trade" },
    "op" : { _WATER_OP : "nabilanavab", "𝟙𝟘" : "pdf|wa|{}|o01", "𝟚𝟘" : "pdf|wa|{}|o02", "𝟛𝟘" : "pdf|wa|{}|o03", "𝟜𝟘" : "pdf|wa|{}|o04",
        "𝟝𝟘" : "pdf|wa|{}|o05", "𝟞𝟘" : "pdf|wa|{}|o06", "𝟟𝟘" : "pdf|wa|{}|o07", "𝟠𝟘" : "pdf|wa|{}|o08", "𝟡𝟘" : "pdf|wa|{}|o09",
        "𝟙𝟘𝟘" : "pdf|wa|{}|o10", _BACK : "pdf|wa" },
    "po" : { _WATER_PO : "nabilanavab", _TOP : "wa|{0}|{1}|pT", _MIDDLE : "wa|{0}|{1}|pM", _BOTTOM : "wa|{0}|{1}|pB", _BACK : "pdf|wa|{0}" },
    "poTXT" : { _WATER_PO : "nabilanavab", _TOP : "pdf|wa|{0}|{1}|pT", _MIDDLE : "pdf|wa|{0}|{1}|pM", _BOTTOM : "pdf|wa|{0}|{1}|pB", _BACK : "pdf|wa|{0}" },
    "color" : { _WATER_COLOR : "nabilanavab", "᠎᠎᠎⚪️" : "#wa|{0}|{1}|{2}|W", "᠎⚫️" : "#wa|{0}|{1}|{2}|B", "᠎᠎🟤" : "#wa|{0}|{1}|{2}|C",
        "᠎🔴" : "#wa|{0}|{1}|{2}|R", "᠎᠎🟢" : "#wa|{0}|{1}|{2}|G", "🔵" : "#wa|{0}|{1}|{2}|N", "᠎᠎🟡" : "#wa|{0}|{1}|{2}|Y",
        "᠎᠎🟠" : "#wa|{0}|{1}|{2}|O", "🟣" : "#wa|{0}|{1}|{2}|V", _BACK : "pdf|wa|{0}|{1}" },
    "stamp" : { _B_STAMP : "nabilanavab", "Not For Public Release 🤧" : "pdf|stp|10", "For Public Release 🥱" : "pdf|stp|8",
        "Confidential 🤫" : "pdf|stp|2", "Departmental 🤝" : "pdf|stp|3", "Experimental 🔬" : "pdf|stp|4", "Expired 🐀" : "pdf|stp|5",
        "Final 🔧" : "pdf|stp|6", "For Comment 🗯️" : "pdf|stp|7", "Not Approved 😒" : "pdf|stp|9", "Approved 🥳" : "pdf|stp|0",
        "Sold ✊" : "pdf|stp|11", "Top Secret 😷" : "pdf|stp|12", "Draft 👀" : "pdf|stp|13", "AsIs 🤏" : "pdf|stp|1", _BACK : "pdf|trade"},
    "stampA" : { _STAMP_COLOR : "nabilanavab", "Red ❤️" : "#spP|{}|r", "Blue 💙" : "#spP|{}|b", "Green 💚" : "#spP|{}|g", "Yellow 💛" : "#spP|{}|c1",
        "Pink 💜" : "#spP|{}|c2", "Hue 💚" : "#spP|{}|c3", "White 🤍" : "#spP|{}|c4", "Black 🖤" : "#spP|{}|c5", _BACK : "pdf|stp" }}
PROGRESS = {"progress" : _PROGRESS , "upFileCB" : {f"📤 .. {_UPLOADING} .. 📤" : "nabilanavab"}, "cbPRO_D" : ["📤 {:.2f}% 📤", _CANCEL], "cbPRO_U" : ["📤 {:.2f}% 📤", _CANCEL]}
GENERATE = {"noQueue" : _NO_QUEUE, "noImages" : _NO_IMG, "currDL" : _DL_IMG, "geting" : _GEN_PDF, "getFileNm" : _REN_PDF, "deleteQueue" : _DLT_QUEUE, "getingCB" : {_GEN_CB : "nabilanavab"},}
DOCUMENT = {
    "replyCB" : { _AIO : "aio" , _SINGLE_USE : "pdf", _CLOSE : "close|all" }, "_replyCB" : PDF_MESSAGE['pdf_button'],
    "reply" : PDF_MESSAGE['pdf'], "upFile" : _START_UPLOAD, "process" : _PROCESSING, "inWork" : _W_I_P, "big" : _BIG,
    "download" : _START_DOWNL, "refresh" : { _REFRESH : "{}" }, "dlImage" : _DL_IMG, "noAPI" : _NO_API, "error" : _ERROR,
    "takeTime" : _TAKE_TIME, "fromFile" : _CONVERT, "unsupport" : _UNSUPPORT, "cancelCB" : { _CANCEL : "close|me" }, "generate" : { _GENERATE : "generate" },
    "generateRN" : { _GENERATE : "generate", _RENAME : "generateREN" }, "setHdImg" : _HD, "setDefault" : { _BACK_DEFAULT : "close|hd" }, "useDOCKER" : _NOT_DOKR,
    "bigCB" : { _BIG_SUPP : "https://github.com/nabilanavab/ilovepdf" }, "imageAdded" : _IMG_ADDED}
AIO = {
    "true" : _TRUE, "false" : _FALSE, "aio" : _PASS_REQUIRED, "waitPASS" : _WAIT_TXT, "passMSG" : _AIO_QN,
    "aio_button" : {_H_AIO :"nabilanavab|aioInput", _YES:"aioInput|enc", _NO :"aioInput|dec", _MOVE :"aioInput|dec" },
    "out_button" : { _META : "nabilanavab|aio|met", _PREVIEW : "nabilanavab|aio|pre", _H_COMPRESS: "nabilanavab|aio|com", _B_TEXT_T : "nabilanavab|aio|txt", _ROTATE : "nabilanavab|aio|rot", _FORMAT : "nabilanavab|aio|for",
        _ENCRYPT_CB : "nabilanavab|aio|enc", _WATERMARK : "nabilanavab|aio|wat", _RENAME : "nabilanavab|aio|rnm", _BACK : "aio", _PROCEED : "processAIO" },
    "out_values": ["aio|met|{F}", "aio|pre|{F}", "aio|com|{F}", "aio|txt|{F}", "aio|rot|{F}", "aio|for|{F}", "aio|enc|{F}", "aio|wat|{F}", "aio|rnm|{F}" ]}
gDOCUMENT = { "admin" : _ADMIN_ONLY, "notDOC" : _NOT_DOC, "Gadmin" : _G_ADMIN, "adminO" : _NOT_YOUR }
gDOCUMENT.update(DOCUMENT)
noHelp = _WASTE
pdf2TXT = {
    "upload" : DOCUMENT['upFile'], "exit" : _EXIT, "nothing" : _NOTHING, "TEXT" : _TEXT2PDF, "start" : _TEXT2PDF_S,
    "font_btn" : {"TXT@PDF » SET FONT" : "nabilanavab", "Times" : "pdf|font|t", "Courier" : "pdf|font|c", "Helvetica (Default)" : "pdf|font|h",
        "Symbol" : "pdf|font|s", "Zapfdingbats" : "pdf|font|z", _CLOSE : "close|me"},
    "size_btn" : {
        "TXT@PDF » {} » SET SCALE" : "nabilanavab", "Portarate" : "t2p|{}|p", "Landscape" : "t2p|{}|l", _BACK: "pdf|T2P"
    }, "askT" : _TEXT2PDF, "askC" : _TEXT2PDF_P}
URL = {
    "notPDF" : _CODEC, "close" : { _CLOSE : "close|all" }, "get" : { _GET_TG_PDF : "getFile"}, "error" : _ERROR,
    "done" : _DONE, "_error_" : _TEXT_REPLY, "openCB" : {_OPEN_BROW : "{}"}, "_error" : _ERROR,"_get" : _TG_PDF }
getFILE = {
    "wait" : _CHECK, "inWork" : DOCUMENT['inWork'], "big" : _BIG, "dl" : {f"📥 ..{_DOWNLOADING}.. 📥" : "nabilanavab"},
    "up" : {f"📤 ..{_UPLOADING}..  📤" : "nabilanavab"}, "complete" : { _COMPLETED : f"{str(settings.SOURCE_CODE)}"}}
cbAns = [_NOT_DEV, _STILL_ERROR, _CANCELED, _NOT_ENCRYPT, _NOTHING_OFF , _COMPLETED ]
LINK = {
    "gen" : _GENERATING, "no" : _UNKNOWN_ERROR, "notify" : _NOTIFY, "_gen" : _URL_PROCES, "type" : _URL_TYPE,
    "notify_pvt" : { _NOTIFY_CB : "link-pvt-ntf", _MUTE_CB : "link-pvt-mut"}, "notify_pub" : { _NOTIFY_CB : "link-pbc-ntf", _MUTE_CB : "link-pbc-mut"},
    "typeBTN" : { _PUBLIC : "link-pub", _PRIVATE : "link-pvt" }, "link" : _GEN_LINK, "error" : _ERROR_ }
INDEX = {
    "rot360" : _YOUR_ERROR, "ocrError" : _OWN_RES, "notEncrypt": _NOT_ENCRYPT, "largeNo" : _MORE_PGS, "inWork" : _W_I_P, "process" : _PROCESSING,
    "pyromodASK_1" : _ASK_PASS, "pyromodASK_2" : _ASK_NAME, "pyromodASK_3" : _ASK_MERGE, "download" : _START_DOWNL, "button" : { _CANCEL : "close|me" }, "error" : _ERROR,
    "decrypt_error" : _PASS_ERROR, "cantCompress" : _CANT_COMP, "completed" : _DL_COMPLETED, "upload" : _START_UPLOAD, "encrypt_caption" : _ENCRYPT_CAPT,
    "rename_caption" : _RENAME_CAPT, "exit" : _EXIT, "compress_caption" : _COMP_CAPT, "askImage" : _ASK_PG, "pdfToImgError" : _ASK_PG_ERROR,
    "_total" : _TOTAL_PG, "_canceledAT" : _CANCEL_AT, "_upload" : _UPLOADING_AL, "finished" : _COMPLETED_SUCC, "cancelCB" : _EXIT,
    "_cancelCB" : {_CANCEL : "close|P2I"}, "_canceledCB" : {_CANCELED_CB : "close|P2IDONE"}, "_completed" : {_COMPLETED : "close|P2ICOMP"},
    "sizeLoad" : _SIZE_LOAD, "mergeDl" : _MERGE_DL, "merge" : _START_MERGE, "watermark_txt" : _WATERMARK_TXT, "watermark_pdf" : _WATERMARK_PDF,
    "watermark_img" : _WATERMARK_IMG, "adding_wa" : _ADD_WATERMARK, "readAgain" : _READ_AGAIN, "zipTAR" : _ZIP_CONVERT, "aio" : _DL_COMPLETED,}
INLINE = {
    "search" : _SEARCH, "openBot" : _OPEN_BOT, 'query' : _TOTAL, 'lang_t' : _SET_LANG, "lang_d" : _H_LANG, 'caption' : _INLINE_CAP,
    "lang_b" : { _SELECT_LANG : "nabilanavab" }, 'sear_t' : _SEARCH_PDF, 'sear_d' : _SEARCH_DES, 'noDB' : '🏃‍♂️🏃‍♂️',
    'min' : _MIN_SEARCH, 'process' : _PROCESSING, 'nothing' : _NO_RESULT, "select" : _GET_PDF, 'description' : _INLINE_DES,
    'cbNotU' : BAN['cbNotU'], 'old' : _OLD_QUEUE, 'inWork' : _W_I_P, 'edit' : [_GET_PDF, _SEARCH_PDF, _OPEN_BOT],}

HELP = {}
