# fileName : lang/mal.py
# copyright ©️ 2021 nabilanavab

from configs.config import settings

HOME = {
    "HomeA" : """ഹേയ് [{}](tg://user?id={})..!!
പിഡിഎഫ് ഉപയോഗിച്ച് നിരവധി കാര്യങ്ങൾ ചെയ്യാൻ ഈ ബോട്ട് നിങ്ങളെ സഹായിക്കും

ചില പ്രധാന സവിശേഷതകൾ ഇവയാണ്:
◍ `ചിത്രങ്ങൾ പിഡിഎഫ്-ലേക്ക് പരിവർത്തനം ചെയ്യുക`
◍ `പിഡിഎഫ് ചിത്രങ്ങളാക്കി മാറ്റുക`
◍ `ഫയലുകൾ പിഡിഎഫിലേക്ക് പരിവർത്തനം ചെയ്യുക`""",
    "HomeACB" : {
        "⚙️ ക്രമീകരണങ്ങൾ ⚙️" : "Home|B",
        "⚠️ സഹായം ⚠️" : "Home|C",
        "📢 ചാനൽ 📢" : f"{str(settings.OWNED_CHANNEL)}",
        "🌟 സോഴ്സ് കോഡ് 🌟" : f"{str(settings.SOURCE_CODE)}",
        "🚶 അടയ്ക്കുക 🚶" : "close|mee"
    },
    "HomeAdminCB" : {
        "⚙️ ക്രമീകരണങ്ങൾ ⚙️" : "Home|B",
        "⚠️ സഹായം ⚠️" : "Home|C",
        "📢 ചാനൽ 📢" : f"{str(settings.OWNED_CHANNEL)}",
        "🌟 സോഴ്സ് കോഡ് 🌟" : f"{str(settings.SOURCE_CODE)}",
        "🗽 പദവി 🗽" : f"status|home",
        "🚶 അടയ്ക്കുക 🚶" : "close|mee"
    },
    "HomeB" : """ക്രമീകരണങ്ങൾ പേജ് ⚙️

പേര്                        : {}
ഐഡി                     : {}
ഉപയോക്തൃനാമം : {}
ചേരുന്ന തീയതി     : {}

ഭാഷ                     : {}
💩                        : {}
ലഘുചിത്രം          : {}
അടിക്കുറിപ്പ്         : {}
ഫയലിന്റെ പേര്   : {}""",
    "HomeBCB" : {
        "🌍 ഭാഷ 🌍" : "set|lang", "📍 ചിത്രം 📍" : "set|thumb",
        "🐲 പേര് 🐲" : "set|fname", "💩 " : "set|api",
        "🤠 അടിക്കുറിപ്പ് 🤠" : "set|capt", "« തിരികെ വീട്ടിലേക്ക് «" : "Home|B2A"
    },
    "HomeC" : """🪂 സഹായ സന്ദേശം 🪂:

പരീക്ഷണ സന്ദേശം""",
    "HomeCCB" : {
        "« തിരികെ വീട്ടിലേക് «" : "Home|A", "⚠️ നിർദ്ദേശങ്ങൾ ⚠️" : "Home|D"
    },
    "HomeD" : """⚠️ നിർദ്ദേശങ്ങൾ ⚠️:

പരീക്ഷണ സന്ദേശം""",
    "HomeDCB" : {
        "⚠️ സഹായ ⚠️" : "Home|C", "» തിരികെ വീട്ടിലേക് »" : "Home|A"
    }  
}

SETTINGS = {
    "default" : ["മാറ്റിയിട്ടില്ല ❌", "ഇഷ്ടാനുസൃത ✅"], "chgLang" : {"ക്രമീകരണങ്ങൾ ⚙️ » ഭാഷ മാറ്റുക 🌐" : "nabilanavab"},
    "error" : "ഡാറ്റാബേസിൽ നിന്ന് ഡാറ്റ എടുക്കുമ്പോൾ എന്തോ കുഴപ്പം സംഭവിച്ചു", "lang" : "Now, Select any language..",
    "ask" : ["ഇപ്പോൾ എനിക്ക് അയക്കൂ..", "Now, Send me.. 😅\n\nവേഗം.! എഴുത്തിലേക്ക് പോകാൻ എനിക്ക് ഇനി സമയമില്ല.. 😏"],
    "wait" : {"കാത്തിരിക്കുന്നു.. 🥱" : "nabilanavab"}, "back" : {"« തിരികെ വീട്ടിലേക് «" : "Home|B2S"}, "errorCB" : {"« തിരികെ വീട്ടിലേക് «" : "Home|B2A"},
    "result" : ["ക്രമീകരണങ്ങൾ അപ്ഡേറ്റ് ചെയ്യാൻ കഴിയില്ല ❌", "ക്രമീകരണങ്ങൾ വിജയകരമായി അപ്ഡേറ്റ് ചെയ്തു ✅"], "cant" : "ഈ ഫീച്ചർ ഉപയോഗിക്കാൻ കഴിയില്ല ❌",
    "feedback" : "നിങ്ങളെപ്പോലുള്ള ആകർഷകമായ ഉപഭോക്താക്കളിൽ നിന്നുള്ള അവലോകനങ്ങൾ മറ്റുള്ളവരെ സഹായിക്കുന്നു.\n@nabilanavab"
                 "\n\nഒരു ബഗ് റിപ്പോർട്ട് ചെയ്യുക {} Lang:\n`• Lang വ്യക്തമാക്കുക\n• പിശക് സന്ദേശം\n• പുതിയ സന്ദേശം`",
    "feedbtn" : {"ബഗ് റിപ്പോർട്ട് ചെയ്യുക" : "report"},
    "thumb" : [
        {"ക്രമീകരണങ്ങൾ ⚙️ » THUMBNAIL 📷" : "nabilanavab", "♻ ചേർക്കുക ♻" : "set|thumb+", "« BACK TO HOME «" : "Home|B"},
        {"ക്രമീകരണങ്ങൾ ⚙️ » THUMBNAIL 📷" : "nabilanavab", "♻ മാറ്റാൻ ♻" : "set|thumb+", "🗑 നശിപ്പിക്കുക 🗑" : "set|thumb-", "« BACK TO HOME «" : "Home|B2S"}
    ],
    "fname" : [
        {"ക്രമീകരണങ്ങൾ ⚙️ » FNAME 📷" : "nabilanavab", "♻ ചേർക്കുക ♻" : "set|fname+", "« BACK TO HOME «" : "Home|B2S"},
        {"ക്രമീകരണങ്ങൾ ⚙️ » FNAME 📷" : "nabilanavab", "♻ മാറ്റാൻ ♻" : "set|fname+", "🗑 നശിപ്പിക്കുക 🗑" : "set|fname-", "« BACK TO HOME «" : "Home|B2S"}
    ],
    "api" : [
        {"ക്രമീകരണങ്ങൾ ⚙️ » API 📷" : "nabilanavab", "♻ ചേർക്കുക ♻" : "set|api+", "« BACK TO HOME «" : "Home|B2S"},
        {"ക്രമീകരണങ്ങൾ ⚙️ » API 📷" : "nabilanavab", "♻ മാറ്റാൻ ♻" : "set|api+", "🗑 നശിപ്പിക്കുക 🗑" : "set|api-", "« BACK TO HOME «" : "Home|B2S"}
    ],
    "capt" : [
        {"ക്രമീകരണങ്ങൾ ⚙️ » CAPTION 📷" : "nabilanavab", "♻ ചേർക്കുക ♻" : "set|capt+", "« BACK TO HOME «" : "Home|B2S"},
        {"ക്രമീകരണങ്ങൾ ⚙️ » CAPTION 📷" : "nabilanavab", "♻ മാറ്റാൻ ♻" : "set|capt+", "🗑 നശിപ്പിക്കുക 🗑" : "set|capt-", "« BACK TO HOME «" : "Home|B2S"}
    ]
}

BOT_COMMAND = {
    "start" : "സ്വാഗത സന്ദേശം..", "help" : "സഹായ സന്ദേശം..",
    "settings" : "ക്രമീകരണ പേജ്..", "txt2pdf" : "ടെക്സ്റ്റ് PDF-കൾ സൃഷ്ടിക്കുക.."
}

HELP_CMD = {
    "userHELP" : """
[ഉപയോക്താക്കളുടെ കമാൻഡ് സന്ദേശങ്ങൾ]:

/start: ബോട്ട് ജീവിച്ചിരിപ്പുണ്ടോ എന്ന് പരിശോധിക്കാൻ\n/help: ഈ സന്ദേശത്തിനായി
/delete: പിഡിഎഫ് ക്യൂവിലേക്ക് ചിത്രം മായ്‌ക്കുക
/txt2pdf: പിഡിഎഫ് ഫയലിലേക്ക് ടെക്സ്റ്റ്""",
    "adminHelp" : """


[അഡ്മിൻമാരുടെ കമാൻഡ് സന്ദേശങ്ങൾ]:

/send: പ്രക്ഷേപണം ചെയ്യാൻ, pm സന്ദേശം""",
    "footerHelp" : f"""


🌟 സോഴ്സ് കോഡ് 🌟: [i 💜 PDF]({str(settings.SOURCE_CODE)})
ബോട്ട്: @complete_pdf_bot 💎
[പിന്തുണ ചാനൽ]({settings.OWNED_CHANNEL})""",
    "CB" : {
        "⚠️ അടയ്ക്കുക ⚠️" : "close|all"
    }
}

STATUS_MSG = {
    "HOME" : "`ഇപ്പോൾ, നിലവിലെ നില ലഭിക്കുന്നതിന് ചുവടെയുള്ള ഏതെങ്കിലും ഓപ്ഷൻ തിരഞ്ഞെടുക്കുക 💱.. `",
    "_HOME" : {
        "📊 ↓ സെർവർ ↓ 📊" : "nabilanavab",
        "📶 സംഭരണം 📶" : "status|server",
        "🥥 ഡാറ്റാബേസ് 🥥" : "status|db",
        "🌝 ↓ ലിസ്റ്റ് നേടുക ↓ 🌝": "nabilanavab",
        "💎 അഡ്മിൻ 💎" : "status|admin",
        "👤 ഉപയോക്താക്കൾ 👤" : "status|users",
        "« തിരികെ «" : "Home|A"
    },
    "BACK" : {
        "« തിരികെ «" : "status|home"
    },
    "DB" : """📂 ഡാറ്റാബേസ് :

**◍ ഡാറ്റാബേസ് ഉപയോക്താക്കൾ :** `{}` 📍
**◍ ഡാറ്റാബേസ് ചാറ്റുകൾ :** `{}` 📍""",
    "SERVER" : """**◍ മൊത്തം സ്ഥലം     :** `{}`
**◍ ഉപയോഗിച്ച സ്ഥലം     :** `{}({}%)`
**◍ സ്വതന്ത്ര ഇടം      :** `{}`
**◍ സിപിയു ഉപയോഗം      :** `{}`%
**◍ റാം ഉപയോഗം     :** `{}`%
**◍ നിലവിലെ ജോലി  :** `{}`
**◍ സന്ദേശ ഐഡി     :** `{}`""",
    "ADMIN" : "**ആകെ അഡ്‌മിൻ:** __{}__\n",
    "USERS" : "ഡിബിയിൽ സേവ് ചെയ്തിട്ടുള്ള ഉപയോക്താക്കൾ:\n\n",
    "NO_DB" : "ഇതുവരെ ഡാറ്റാബേസ് സജ്ജീകരിച്ചിട്ടില്ല 💩"
}

feedbackMsg = f"[ഒരു ഫീഡ്ബാക്ക് എഴുതുക 📋]({settings.FEEDBACK})"

# GROUP WELCOME MESSAGE
HomeG = {
    "HomeA" : """ഹേയ്, അവിടെയുണ്ടോ.! 🖐️
ഞാനിവിടെ പുതിയതാണ് {message.chat.title}

ഞാൻ എന്നെത്തന്നെ പരിചയപ്പെടുത്തട്ടെ..
എന്റെ പേര് iLovePDF ആണ്, @Telegram പിഡിഎഫ് ഫയലുകൾ ഉപയോഗിച്ച് നിരവധി കാര്യങ്ങൾ ചെയ്യാൻ എനിക്ക് നിങ്ങളെ സഹായിക്കാനാകും

ഈ ആകർഷണീയമായ ബോട്ടിന് @nabilanavab നന്ദി 😅""",
    "HomeACB" : {
        "🤠 ബോട്ട് ഉടമ 🤠": f"https://telegram.dog/{settings.OWNER_USERNAME}",
        "🛡️ ചാനൽ 🛡️": f"{settings.OWNED_CHANNEL}",
        "🌟 സോഴ്സ് കോഡ് 🌟": f"{settings.SOURCE_CODE}"
    }
}

BAN = {
    "cbNotU" : "സന്ദേശം നിങ്ങൾക്കുള്ളതല്ല.. 😏",
    "banCB" : {
        "നിങ്ങളുടെ സ്വന്തം ബോട്ട് സൃഷ്ടിക്കുക": f"{settings.SOURCE_CODE}",
        "ട്യൂട്ടോറിയൽ": f"{settings.SOURCE_CODE}",
        "ചാനൽ അപ്ഡേറ്റ് ചെയ്യുക": "https://telegram.dog/ilovepdf_bot"
    },
    "UCantUse" : """ഹേയ് {}

ചില കാരണങ്ങളാൽ നിങ്ങൾക്ക് ഈ ബോട്ട് ഉപയോഗിക്കാൻ കഴിയില്ല :(""",
    "UCantUseDB" : """ഹേയ് {}

ചില കാരണങ്ങളാൽ നിങ്ങൾക്ക് ഈ ബോട്ട് ഉപയോഗിക്കാൻ കഴിയില്ല :(

കാരണം: {}""",
    "GroupCantUse" : """{} എന്നിൽ നിന്ന് ഒരു നല്ല പ്രതികരണം ഒരിക്കലും പ്രതീക്ഷിക്കരുത്

അഡ്മിൻസ് എന്നെ ഇവിടെ ജോലി ചെയ്യുന്നതിൽ നിന്ന് പരിമിതപ്പെടുത്തി.. 🤭""",
    "GroupCantUseDB" : """{} എന്നിൽ നിന്ന് ഒരു നല്ല പ്രതികരണം ഒരിക്കലും പ്രതീക്ഷിക്കരുത്

അഡ്മിൻസ് എന്നെ ഇവിടെ ജോലി ചെയ്യുന്നതിൽ നിന്ന് പരിമിതപ്പെടുത്തി.... 🤭

കാരണം: {}""",
    "Force" : """നിൽക്കുക [{}](tg://user?id={})..!!

വലിയ ട്രാഫിക് കാരണം ചാനൽ അംഗങ്ങൾക്ക് മാത്രമേ ഈ ബോട്ട് ഉപയോഗിക്കാൻ കഴിയൂ 🚶

എന്നെ ഉപയോഗിക്കുന്നതിന് നിങ്ങൾ താഴെ സൂചിപ്പിച്ച ചാനലിൽ ചേരണം എന്നാണ് ഇതിനർത്ഥം!

ചേർന്നതിന് ശേഷം `"♻️വീണ്ടും ശ്രമിക്കുക♻️"` എന്നതിൽ അമർത്തുക.. 😅""",
    "ForceCB" : {
        "🌟 ചാനലിൽ ചേരുക 🌟" : "{}",
        "♻️ വീണ്ടും ശ്രമിക്കുക ♻️" : "refresh"
    },
    "Fool" : "വിളച്ചിലെടുക്കല്ലേ കേട്ടോ.. 🤭"
}

checkPdf = {
    "pg" : "`പേജുകളുടെ എണ്ണം: •{}•` 🌟",
    "pdf" : """`ഈ ഫയൽ ഉപയോഗിച്ച് ഞാൻ എന്തുചെയ്യണം?.?`

ഫയലിന്റെ പേര് : `{}`
ഫയൽ വലിപ്പം : `{}`""",
    "pdfCB" : {
        "⭐ മെറ്റാഡാറ്റ ⭐" : "metaData", "🗳️ പ്രിവ്യൂ 🗳️" : "preview",
        "🖼️ ചിത്രങ്ങൾ 🖼️" : "pdf|img", "✏️ വാചകം ✏️" : "pdf|txt",
        "🔐 എൻക്രിപ്റ്റ് 🔐" : "work|encrypt", "🔒 ഡീക്രിപ്റ്റ് 🔓" : "work|decrypt",
        "🗜️ COMPRESS 🗜️" : "work|compress", "🤸 തിരിക്കുക 🤸" : "pdf|rotate",
        "✂️ പിരിയുക ✂️" : "pdf|split", "🧬 ലയിപ്പിക്കുക 🧬" : "merge",
        "™️ സ്റ്റാമ്പ് ™️" : "pdf|stp", "✏️ പേരുമാറ്റുക ✏️" : "work|rename",
        "📝 ഒസിആർ 📝" : "work|ocr", "🥷 A4 ഫോർമാറ്റ് 🥷" : "work|format",
        "🚫 അടയ്ക്കുക 🚫" : "close|all"
    },
    "error" : """__ഈ ഫയലിൽ ഞാൻ ഒന്നും ചെയ്യുന്നില്ല__ 😏

🐉  `കോഡെക് പിശക്`  🐉""",
    "errorCB" : {
        "❌ കോഡെക് പിശക് ❌" : "error",
        "🔸 അടയ്ക്കുക 🔸" : "close|all"
    },
    "encrypt" : """`ഫയൽ എൻക്രിപ്റ്റ് ചെയ്തിരിക്കുന്നു` 🔐

ഫയലിന്റെ പേര് : `{}`
ഫയൽ വലിപ് : `{}`""",
    "encryptCB" : {
        "🔓 എൻക്രിപ്റ്റ് 🔓" : "work|decrypt"
    }
}

PROGRESS = {
    "progress" : """**\nചെയ്തു ✅ : **{0}/{1}
**വേഗത 🚀:** {2}/s
**കണക്കാക്കിയ സമയം ⏳:** {3}""",
    "dlImage" : "`നിങ്ങളുടെ ചിത്രം ഡൗൺലോഡ് ചെയ്യുന്നു..⏳`",
    "upFile" : "`അപ്‌ലോഡ് ചെയ്യാൻ തുടങ്ങി..`📤",
    "dlFile" : "`നിങ്ങളുടെ ഫയൽ ഡൗൺലോഡ് ചെയ്യുന്നു..` 📥",
    "upFileCB" : {"📤 .. അപ്‌ലോഡ് .. 📤" : "nabilanavab"},
    "workInP" : "ജോലി പുരോഗമിക്കുന്നു.. 🙇",
    "takeTime" : """`⚙️ ജോലി പുരോഗമിക്കുന്നു..`
`കുറച്ച് സമയമെടുത്തേക്കാം..`💛""",
    "refresh" : {"♻️ വീണ്ടും ശ്രമിക്കുക ♻️" : "refresh{}"}
}

GENERATE = {
    "deleteQueue" : "`ക്യൂ ഇല്ലാതാക്കി..`🤧",
    "noQueue" : "`ക്യൂ സ്ഥാപിച്ചിട്ടില്ല..`😲",
    "noImages" : "ചിത്രമൊന്നും സ്ഥാപിച്ചിട്ടില്ല.! 😒",
    "getFileNm" : "ഇപ്പോൾ എനിക്ക് ഒരു ഫയൽ നാമം അയയ്ക്കുക 😒: ",
    "geting" : "ഫയലിന്റെ പേര്: `{}`\nപേജുകൾ: `{}`",
    "getingCB" : {"📚 പിഡിഎഫ് സൃഷ്ടിക്കുന്നു.." : "nabilanavab"}
}

document = {
    "refresh" : PROGRESS['refresh'], "inWork" : PROGRESS['workInP'], "reply" : checkPdf['pdf'], "replyCB" : checkPdf['pdfCB'],
    "takeTime" : PROGRESS['takeTime'], "upFile" : PROGRESS['upFile'], "dlImage" : PROGRESS['dlImage'], "download" : PROGRESS['dlFile'],
    "process" : "⚙️ പ്രോസസ്സിംഗ്..",
    "big" : """ഓവർലോഡ് കാരണം, പിഡിഎഫ് ഫയലുകൾക്കായി ഉടമ {}mb പരിമിതപ്പെടുത്തുന്നു🙇

`ദയവായി എനിക്ക് {}mb വലുപ്പം-ൽ കുറവുള്ള ഒരു ഫയൽ അയയ്‌ക്കുക 🙃""",
    "bigCB" : {"💎 2Gb സപ്പോർട്ട് ബോട്ട് സൃഷ്ടിക്കുക 💎" : "https://github.com/nabilanavab/ilovepdf"},
    "imageAdded" : """`നിങ്ങളുടെ പിഡിഎഫിൽ {} പേജ്/കൾ ചേർത്തു..`🤓

fileName: `{}.pdf`""",
    "error" : """എന്തോ കുഴപ്പം സംഭവിച്ചു.. 🐉

പിശക്: `{}`""",
    "noAPI" : "`ConvertAPI ചേർക്കാൻ ഉടമ മറന്നു.. ഉടമയെ ബന്ധപ്പെടുക 😒`",
    "useDOCKER" : "`ഫയൽ പിന്തുണയ്ക്കുന്നില്ല, ഡോക്കർ ഉപയോഗിച്ച് ബോട്ട് വിന്യസിക്കുക`",
    "fromFile" : "`പരിവർത്തനം ചെയ്തു: {} to {}`",
    "unsupport" : "`പിന്തുണയ്ക്കാത്ത ഫയൽ..🙄`",
    "generateRN" : {"സൃഷ്ടിക്കാൻ 📚" : "generate", "പേരുമാറ്റുക ✍️" : "generateREN"},
    "generate" : {"സൃഷ്ടിക്കാൻ 📚" : "generate"},
    "cancelCB" : {"⟨ റദ്ദാക്കുക ⟩" : "close|me"}
}

noHelp = f"`ആരും നിങ്ങളെ സഹായിക്കാൻ പോകുന്നില്ല` 😏"

split = {
    "inWork" : PROGRESS['workInP'], "cancelCB" : document['cancelCB'], "download" : PROGRESS['dlFile'], "upload" : PROGRESS['upFile'],              # [🔴]
    "button" : {
        "⚙️ പിഡിഎഫ് വിഭജനം ↓" : "nabilanavab",
        "പരിധിയിൽ 🦞" : "split|R", "ഒറ്റ പേജ് 🐛" : "split|S",
        "« BACK «" : "pdf"
    },
    "work" : ["Range", "Single"],
    "over" : "`5 ശ്രമം കഴിഞ്ഞു.. പ്രക്രിയ റദ്ദാക്കി..`😏",
    "pyromodASK_1" : """__Pdf വിഭജനം » ശ്രേണി പ്രകാരം
ഇപ്പോൾ, ശ്രേണി നൽകുക (ആരംഭം:അവസാനം) :__

/exit __റദ്ദാക്കാൻ__""",
    "exit" : "`പ്രക്രിയ റദ്ദാക്കി..` 😏",
    "error_1" : "`വാക്യഘടന പിശക്: justNeedStartAndEnd `🚶",
    "error_2" : "`വാക്യഘടന പിശക്: errorInEndingPageNumber `🚶",
    "error_3" : "`വാക്യഘടന പിശക്: errorInStartingPageNumber `🚶",
    "error_4" : "`വാക്യഘടന പിശക്: pageNumberMustBeADigit` 🧠",
    "error_5" : "`വാക്യഘടന പിശക്: noEndingPageNumber Or notADigit` 🚶",
    "error_6" : "`നമ്പർ ഒന്നും കണ്ടെത്താൻ കഴിയുന്നില്ല..`😏",
    "error_7" : "`എന്തോ കുഴപ്പം സംഭവിച്ചു..`😅",
    "error_8" : "`{}-ൽ താഴെ നമ്പറുകൾ നൽകുക..`😏",
    "error_9" : "`ആദ്യം പേജുകളുടെ എണ്ണം പരിശോധിക്കുക` 😏",
    "completed" : "`ഡൗൺലോഡ് പൂർത്തിയായി..` ✅",
}

pdf2IMG = {
    "inWork" : PROGRESS['workInP'], "process" : document['process'], "over" : split['over'],                                                        # [🔴]
    "toImage" : {
        "⚙️ പിഡിഎഫ് ചിത്രങ്ങൾ ↓" : "nabilanavab",
        "🖼 ചിത്രങ്ങൾ 🖼" : "pdf|img|img", "📂 ഫയൽ 📂" : "pdf|img|doc",
        "🤐 ZIP 🤐" : "pdf|img|zip", "🎯 TAR 🎯" : "pdf|img|tar",
        "« തിരികെ «" : "pdf"
    },
    "imgRange" : {
        "⚙️ ിഡിഎഫ് ചിത്രങ്ങൾ » {} ↓" : "nabilanavab",
        "🙄 എല്ലാം 🙄" : "p2img|{}A", "🤧 റേഞ്ച് 🤧" : "p2img|{}R", "🌝 പേജുകൾ 🌝" : "p2img|{}S",
        "« തിരികെ «" : "pdf|img"
    },
    "pyromodASK_1" : """__പിഡിഎഫ് - Img› ഡോക് » പേജുകൾ:
ഇപ്പോൾ, ശ്രേണി നൽകുക (ആരംഭം:അവസാനം) :__

/exit __റദ്ദാക്കാൻ__""",
    "pyromodASK_2" : """"__പിഡിഎഫ് - Img› ഡോക് » പേജുകൾ:
ഇപ്പോൾ,__ (,) പ്രകാരം വേർതിരിച്ച പേജ് നമ്പറുകൾ നൽകുക :

/exit __റദ്ദാക്കാൻ__""",
    "exit" : split['exit'], "error_1" : split['error_1'], "error_2" : split['error_2'], "error_3" : split['error_3'],                               # [🔴]
    "error_4" : split['error_4'], "error_5" : split['error_5'], "error_6" : split['error_6'], "error_7" : split['error_7'],                         # [🔴]
    "error_8" : split['error_8'], "error_9" : split['error_9'], "download" : PROGRESS['dlFile'], "uploadfile" : PROGRESS["upFile"],                 # [🔴]
    "error_10" : "___ചില നിയന്ത്രണങ്ങൾ കാരണം ബോട്ട് 50 പേജുകൾ മാത്രം ZIP ആയി അയയ്ക്കുന്നു..__😅",
    "total" : "`ആകെ പേജുകൾ : {}..⏳`",
    "upload" : "`അപ്‌ലോഡ് ചെയ്യുന്നു: {}/{} പേജുകൾ.. 🐬`",
    "current" : "`സൃഷ്ടിച്ചത് : {}/{} പേജുകൾ.. 🤞`",  # zip, tar
    "complete" : "`അപ്‌ലോഡിംഗ് പൂർത്തിയായി.. `🏌️",
    "canceledAT" : "`{}/{}-എന്ന സമയത്ത് റദ്ദാക്കി പേജുകൾ..` 🙄",
    "cbAns" : "⚙️ ഒകെയ്ഡ, റദ്ദാക്കുന്നു.. ",
    "cancelCB" : {"💤 റദ്ദാക്കുക 💤" : "close|P2I"},     # EDITABLE: ❌
    "canceledCB" : {"🍄 റദ്ദാക്കി 🍄" : "close|P2IDONE"},
    "completed" : {"😎 പൂർത്തിയായി 😎" : "close|P2ICOMP"}
}

merge = {
    "inWork" : PROGRESS['workInP'], "process" : document['process'], "upload" : PROGRESS['upFile'],
    "load" : "__ഓവർലോഡ് കാരണം നിങ്ങൾക്ക് ഒരു സമയം 5 പിഡിഎഫ്-കൾ മാത്രമേ ലയിപ്പിക്കാൻ കഴിയൂ__",
    "sizeLoad" : "`ഓവർലോഡ് കാരണം ബോട്ട് മാത്രം %sMb പിഡിഎഫ്-കൾ പിന്തുണയ്ക്കുന്നു..`", # removing %s show error
    "pyromodASK" : """__MERGE പിഡിഎഫ് » ക്യൂവിലുള്ള ആകെ pdf-കൾ: {}__

/exit __റദ്ദാക്കാൻ__
/merge __ ലയിപ്പിക്കുക__""",
    "exit" : split['exit'],
    "total" : "`ആകെ പിഡിഎഫ്'കൾ : {} 💡",
    "current" : "__{}-പിഡിഎഫ് ഡൗൺലോഡ് ചെയ്യാൻ തുടങ്ങി 📥__",
    "cancel" : "`ലയന പ്രക്രിയ റദ്ദാക്കി.. 😏`",
    "started" : "__ലയനം ആരംഭിച്ചു.. __ 🪄",
    "caption" : "`ലയിപ്പിച്ച പിഡിഎഫ് 🙂`"
}

metaData = {
    "inWork" : PROGRESS['workInP'], "process" : document['process'], "download" : PROGRESS['dlFile'],                                                # [🔴]
    "read" : "ദയവായി ഈ സന്ദേശം വീണ്ടും വായിക്കുക.. 🥴"
}

preview = {
    "inWork" : PROGRESS['workInP'], "process" : document['process'], "download" : PROGRESS['dlFile'], "error" : document['error'],                   # [🔴]
    "_" : "പിഡിഎഫ് ൽ {} പേജുകൾ മാത്രമേ ഉള്ളൂ.. 🤓\n\n",
    "__" : "പിഡിഎഫ് പേജുകൾ: {}\n\n", "total" : "`Total പേജുകൾ: {}..` 🤌",
    "album" : "`ഒരു ആൽബം തയ്യാറാക്കുന്നു..` 🤹", "upload" : f"`Uploading: പ്രിവ്യൂ പേജുകൾ.... 🐬`",
    
}

stamp = {
    "stamp" : {
        "⚙️ PDF » STAMP ↓" : "nabilanavab",
        "Not For Public Release 🤧" : "pdf|stp|10", "For Public Release 🥱" : "pdf|stp|8",
        "Confidential 🤫" : "pdf|stp|2", "Departmental 🤝" : "pdf|stp|3", "Experimental 🔬" : "pdf|stp|4", "Expired 🐀" : "pdf|stp|5",
        "Final 🔧" : "pdf|stp|6", "For Comment 🗯️" : "pdf|stp|7", "Not Approved 😒" : "pdf|stp|9", "Approved 🥳" : "pdf|stp|0",
        "Sold ✊" : "pdf|stp|11", "Top Secret 😷" : "pdf|stp|12", "Draft 👀" : "pdf|stp|13", "AsIs 🤏" : "pdf|stp|1",
        "« BACK «" : "pdf"
    },
    "stampA" : {
        "⚙️ പിഡിഎഫ് » STAMP » COLOR ↓" : "nabilanavab",
        "Red ❤️" : "spP|{}|r", "Blue 💙" : "spP|{}|b", "Green 💚" : "spP|{}|g", "Yellow 💛" : "spP|{}|c1",
        "Pink 💜" : "spP|{}|c2", "Hue 💚" : "spP|{}|c3", "White 🤍" : "spP|{}|c4", "Black 🖤" : "spP|{}|c5",
        "« Back «" : "pdf|stp"
    },
    "inWork" : PROGRESS['workInP'], "process" : document['process'], "download" : PROGRESS['dlFile'], "upload" : PROGRESS['upFile'],                # [🔴]
    "stamping" : "`സ്റ്റാമ്പിംഗ് ആരംഭിച്ചു..` 💠",
    "caption" : """സ്റ്റാമ്പ് ചെയ്ത പിഡിഎഫ്
നിറം : `{}`
സ്റ്റാമ്പ് : `{}`"""
}

# fileName : plugins/dm/callBack/_main_.py
work = {
    "inWork" : PROGRESS['workInP'], "process" : document['process'], "exit" : split['exit'], "download" : PROGRESS['dlFile'],                       # [🔴]
    "upload" : PROGRESS['upFile'], "button" : document['cancelCB'],  "takeTime" : PROGRESS['takeTime'],                                             # [🔴]
    "rot360" : "നിനക്ക് എന്തോ വലിയ പ്രശ്നമുണ്ട്..🙂", "ocrError" : "ഉടമ നിയന്ത്രിച്ചു 😎🤏",
    "largeNo" : "5 പേജിൽ താഴെയുള്ള പിഡിഎഫ് ഫയൽ അയയ്ക്കുക.. 🙄",
    "pyromodASK_1" : """__പിഡിഎഫ് {} »
ഇപ്പോൾ, ദയവായി പാസ്‌വേഡ് നൽകുക :__

/exit __റദ്ദാക്കാൻ__""",
    "pyromodASK_2" : """__പിഡിഎഫ്-ന്റെ പേര് മാറ്റുക »
ഇപ്പോൾ, ദയവായി പുതിയ പേര് നൽകുക:__

/exit __റദ്ദാക്കാൻ __""",
    "ren_caption" : "__പുതിയ പേര്:__ `{}`",
    "notENCRYPTED" : "`ഫയൽ എൻക്രിപ്റ്റ് ചെയ്തിട്ടില്..` 👀",
    "compress" : "⚙️ `കംപ്രസ് ചെയ്യാൻ തുടങ്ങി.. 🌡️\nകുറച്ച് സമയമെടുത്തേക്കാം..`💛",
    "decrypt" : "⚙️ `ഡീക്രിപ്റ്റ് ചെയ്യാൻ തുടങ്ങി.. 🔓\nകുറച്ച് സമയമെടുത്തേക്കാം..`💛",
    "encrypt" : "⚙️ `എൻക്രിപ്റ്റ് ചെയ്യാൻ തുടങ്ങി.. 🔐\nകുറച്ച് സമയമെടുത്തേക്കാം..`💛",
    "ocr" : "⚙️ `OCR ലെയർ ചേർക്കുന്നു.. ✍️\nകുറച്ച് സമയമെടുത്തേക്കാം..`💛",
    "format" : "⚙️ `ഫോർമാറ്റിംഗ് ആരംഭിച്ചു.. 🤘\nകുറച്ച് സമയമെടുത്തേക്കാം..`💛",
    "rename" : "⚙️ `പിഡിഎഫ് പുനർനാമകരണം ചെയ്യുന്നു.. ✏️\nകുറച്ച് സമയമെടുത്തേക്കാം..`💛",
    "rot" : "⚙️ `പിഡിഎഫ് കറങ്ങുന്നു.. 🤸\nകുറച്ച് സമയമെടുത്തേക്കാം..`💛",
    "pdfTxt" : "⚙️ `വാചകം എക്‌സ്‌ട്രാക്റ്റുചെയ്യുന്നു.. 🐾\nകുറച്ച് സമയമെടുത്തേക്കാം..`💛",
    "fileNm" : "പഴയ പേര്: {}\nപുതിയ പേര്: {}",
    "rotate" : {
        "⚙️ പിഡിഎഫ് » തിരിക്കുക ↓" : "nabilanavab",
        "90°" : "work|rot90", "180°" : "work|rot180", "270°" : "work|rot270", "360°" : "work|rot360",
        "« തിരികെ «" : "pdf"
    },
    "txt" : {
        "⚙️ PDF » വചനം ↓" : "nabilanavab",
        "📜 സന്ദേശം 📜" : "work|M", "🧾 പട്ടിക 🧾" : "work|T", "🌐 HTML 🌐" : "work|H", "🎀 JSON 🎀" : "work|J",
        "« തിരികെ «" : "pdf"
    }
}

PROCESS = {
    # captions
    "ocr" : "OCR കൂട്ടിച്ചേർത്തു", "decryptError" : "`{}` __ഉപയോഗിച്ച് ഫയൽ ഡീക്രിപ്റ്റ് ചെയ്യാൻ കഴിയില്ല__ 🕸️",
    "decrypted" : "__ഡീക്രിപ്റ്റ് ചെയ്ത ഫയൽ__", "encrypted" : "__പേജ് നമ്പർ__: {}\n__താക്കോൽ__ 🔐: ||{}||",
    "compressed" : """`യഥാർത്ഥ വലുപ്പം : {}
ചുരുക്കിയ വലുപ്പം : {}

അനുപാതം : {:.2f} %`""",
    "cantCompress" : "ഫയൽ കൂടുതൽ കംപ്രസ് ചെയ്യാൻ കഴിയില്ല..🤐",
    "pgNoError" : """__ചില കാരണങ്ങളാൽ A4 ഫോർമാറ്റിംഗ് 5 പേജിൽ താഴെയുള്ള pdf-കൾക്കുള്ള പിന്തുണ__

ആകെ പേജുകൾ: {} ⭐""",
    "ocrError" : "`ഇതിനകം ഒരു ടെക്സ്റ്റ് ലെയർ ഉണ്ട്.. `😏",
    "90" : "__90° കറക്കി__", "180" : "__180° കറക്കി__", "270" : "__270° കറക്കി__",
    "formatted" : "A4 ഫോർമാറ്റ് ചെയ്ത ഫയൽ", "M" : "♻ വേർതിരിച്ചെടുത്തത് {} പേജുകൾ.. ♻",
    "H" : "HTML ഫയൽ", "T" : "TXT ഫയൽ", "J" : "JSON ഫയൽ"
}

cbAns = [
    "ഈ സവിശേഷത വികസനത്തിലാണ് ⛷️", "എറർ അണ്ണൻ പറഞില്ലേ.. പിന്നെ എന്ത്.. 😏",
    "പ്രക്രിയ റദ്ദാക്കി.. 😏", "ഫയൽ എൻക്രിപ്റ്റ് ചെയ്തിട്ടില്ല.. 👀", "അതിനെക്കുറിച്ച് ഔദ്യോഗികമായി ഒന്നുമില്ല.. 😅", "🎉 പൂർത്തിയാക്കി.. 🏃"
]

# ===================================================================================================================================[NABIL A NAVAB -> TG: nabilanavab]
